{
    "1": {
        "url": "https://www.youtube.com//watch?v=DO_7OOEoEUk",
        "description": ""
    },
    "2": {
        "url": "https://www.youtube.com//watch?v=sMnN2xZCook",
        "description": "*DISCLAIMER* This footage is part of an war archive of the war in Iraq and should be viewed as educational. This footage is not meant to glorify war or violence. I am only sharing this footage for the purposes of news reporting and educating. This is a war documentary.\n\nThe 2003 invasion of Iraq lasted from 20 March to 1 May 2003 and signaled the start of the Iraq War, which was dubbed Operation Iraqi Freedom by the United States (prior to 19 March, the mission in Iraq was called Operation Enduring Freedom, a carryover from the War in Afghanistan).The invasion consisted of 21 days of major combat operations, in which a combined force of troops from the United States, the United Kingdom, Australia and Poland invaded Iraq and deposed the Ba'athist government of Saddam Hussein. The invasion phase consisted primarily of a conventionally fought war which concluded with the capture of the Iraqi capital of Baghdad by American forces."
    },
    "3": {
        "url": "https://www.youtube.com//watch?v=QKN09nf6BC8",
        "description": "Combat footage of U.S. Marines and U.S. Army Soldiers in Afghanistan. Filmed in 2011. \n\n*DISCLAIMER* This footage is part of an war archive of the war in Afghanistan and should be viewed as educational. This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating. This is a war documentary."
    },
    "4": {
        "url": "https://www.youtube.com//watch?v=JgQ4lVzj7xY",
        "description": "*DISCLAIMER* The following video is not meant to glorify war or violence. This footage is not intended to offend anyone. Video for informational purposes only. Viewer discretion is advised."
    },
    "5": {
        "url": "https://www.youtube.com//watch?v=B6lkIzMZGcU",
        "description": "The Rockwell B-1 Lancer is a supersonic variable-sweep wing, heavy aircraft used by the United States Air Force (USAF). It is commonly called the \"Bone\" (from \"B-One\"). The USAF had 66 B-1Bs in service as of September 2012. The B-1B is expected to continue to serve into the 2030s, with the Northrop Grumman B-21 Raider to begin replacing the B-1B after 2025. The B-1s currently in inventory will reach the end of their service lives by 2045."
    },
    "6": {
        "url": "https://www.youtube.com//watch?v=QpnjGjaLgz8",
        "description": "*DISCLAIMER* This footage is part of a war archive of the war in Syria and should be viewed as an educational, historical and documentary film about the military conflict. This footage is also to be taken as a raw documentary on the events of the conflict in Syria. The video STRICTLY for informational, documentary and historical purposes only! This footage is not meant to glorify war or violence. The video is not intended to offend anyone. This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting, sharing important information with the public and educating.\n\nWar in Syria 2018 - Battle of Afrin(code-named Operation Olive Branch).\n\nIn January 2018, the Turkish military launched a military operation in the Kurdish-controlled Afrin District and the Tell Rifaat Subdistrict in Northern Syria. The offensive is against the Kurdish-led Democratic Union Party in Syria (PYD), its armed wing People's Protection Units (YPG), and Syrian Democratic Forces (SDF) positions surrounding the Syrian city of Afrin. Afrin and the surrounding area is claimed by the Democratic Federation of Northern Syria as Afrin Canton, part of its Afrin Region. It is the first major military operation by Turkey in Syria since Operation Euphrates Shield.\n\nThe Free Syrian Army and Turkish forces have made advances against the People’s Protection Units in Afrin. According to the Turkish command, Operation Olive Branch has managed to take control of several villages and strategic locations in the Afrin countryside.\n\nSyrian National Coalition supported the joint operation of the FSA and the Turkish Armed Forces.\n\nTurkey launched an air and ground offensive on the Afrin region, opening a new front in the multi-sided Syrian war to target Kurdish fighters in northern Syria.\n\nBut in general terms the offensive has not been very successful so far, most of the larger towns in the region, including Afrin itself, remain under YPG control.\n\nBattle for Afrin continues...\n\nYou may support this channel by simply purchasing products on Amazon via the following link below."
    },
    "7": {
        "url": "https://www.youtube.com//watch?v=imGqq235Zl0",
        "description": "The nuclear weapon tests conducted by the United States at Bikini Atoll in mid-1946-56. The purpose of the tests was to examine how underwater explosions affected materiel, investigate the effect of nuclear weapons on warships, etc.\n\nThe Pacific Proving Grounds was the name given by the United States government to a number of sites in the Marshall Islands and a few other sites in the Pacific Ocean at which it conducted nuclear testing between 1946 and 1962. The U.S. tested a nuclear weapon (codenamed Able) on Bikini Atoll on 30 June 1946. This was followed by Baker on July 24, 1946."
    },
    "8": {
        "url": "https://www.youtube.com//watch?v=RkZ_flOq5Og",
        "description": "Soldiers from various nations demonstrate their skills, distance firing, during the European Best Sniper Squad Competition at the 7th Army Training Command’s, Grafenwoehr training area, Bavaria, Germany, Oct. 2017. The European Best Sniper Squad Competition is an Army Europe competition challenging militaries from across Europe to compete and enhance teamwork with Allies and partner nations."
    },
    "9": {
        "url": "https://www.youtube.com//watch?v=SbyLeWqi5QY",
        "description": "Danish soldiers fire 155 mm artillery rounds from the CAESAR self-propelled howitzer, the upcoming Danish self-propelled artillery system.\n\nThe CAESAR is a French self-propelled 155 mm/52-calibre gun-howitzer, installed on a 6X6 truck chassis. Examples built for the French Army use a Renault Sherpa 10 chassis, examples built for export utilize the 6x6 Unimog U2450L chassis. The CAESAR platform was developed by the former GIAT Industries (now known as Nexter) and is operated by the French, Indonesian, Saudi Arabian, and Thai militaries."
    },
    "10": {
        "url": "https://www.youtube.com//watch?v=u1FLYarJW2I",
        "description": "The Machine gunners participated in a basic qualification course to test the soldiers’ skills behind their weapons. Helmet Cam footage of Swedish soldier during fire an MG3 machine gun during a combined arms exercise. The combined arms exercise allowed riflemen and machine gunners to work together by closing with and destroying targets by fire. \n\nThe MG 3 is a German general-purpose machine gun chambered for the 7.62×51mm NATO cartridge. The MG 3 was standardized in the late 1950s and adopted into service with the newly formed Bundeswehr, where it continues to serve to this day as a squad support weapon and a vehicle-mounted machine gun. The weapon and its derivatives have also been acquired by the armed forces of over 30 countries."
    },
    "11": {
        "url": "https://www.youtube.com//watch?v=79qa03w4Lts",
        "description": "Ukrainian Soldiers Helmet Cam Combat Footage | Ukraine War \n*DISCLAIMER* This footage is part of an war archive of the war in Ukraine and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Ukraine. This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating."
    },
    "12": {
        "url": "https://www.youtube.com//watch?v=cT9orXK5krY",
        "description": "This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating. I also want to share this footage for: news reporting, sharing important information with the public, and the transformative nature of the footage."
    },
    "13": {
        "url": "https://www.youtube.com//watch?v=A4bk1P5KDu4",
        "description": "*DISCLAIMER* This footage is part of an war archvie of the war in Syria and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Syria. This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating. I also want to share this footage for: news reporting, sharing important information with the public, and the transformative nature of the footage."
    },
    "14": {
        "url": "https://www.youtube.com//watch?v=FCbi-LzJq0Y",
        "description": "*DISCLAIMER* This footage is part of an war archive of the war in Syria and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Syria. This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating. I also want to share this footage for: news reporting, sharing important information with the public."
    },
    "15": {
        "url": "https://www.youtube.com//watch?v=ARCljv8gZro",
        "description": "*DISCLAIMER* This footage is part of an war archive of the war in Afghanistan and should be viewed as educational. This footage is not meant to glorify war or violence. I am only sharing this footage for the purposes of news reporting and educating. This is a war documentary.\n\nEverything changed when two 82nd Airborne Paratroopers tragically drowned in the muddy Bala Murghab River while trying to retrieve vital supplies from an airdrop that had gone terribly wrong. In that one moment, the focus and purpose of the friendly forces at Forward Operating Base Todd changed forever. With the assistance of U.S. Marine Special Operations Team 8222, a massive clearing operation was initiated to break the Taliban's stranglehold on the valley and its people. It took over seven months of fighting."
    },
    "16": {
        "url": "https://www.youtube.com//watch?v=uOAKUgjMV1Y",
        "description": "Archive Video about the French Foreign Legion, Army Soldiers & Marines in Afghanistan.\n*DISCLAIMER* This footage is part of an war archive of the war in Afghanistan and should be viewed as educational. This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating. This is a war documentary."
    },
    "17": {
        "url": "https://www.youtube.com//watch?v=2ZmC_cIhMqI",
        "description": "*DISCLAIMER* This footage is part of an war archive of the war in Ukraine and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Ukraine. This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating. I also want to share this footage for: news reporting, sharing important information with the public, and the transformative nature of the footage.\n\nVideo Collection(Ukrainina Armed Forces) about fighting in eastern Ukraine, which has not been previously published. Videos old but very interesting and informative and I think they should be publish, maybe you have not seen their before."
    },
    "18": {
        "url": "https://www.youtube.com//watch?v=Kc7qftcGa1w",
        "description": "*DISCLAIMER* This footage is part of an war archive of the war in Yemen and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Yemen. This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating."
    },
    "19": {
        "url": "https://www.youtube.com//watch?v=k_uYbjaaXHs",
        "description": "Ukraine War(Archive video). Video collection of the battles of Ukrainian Forces(Right Sector) near Donetsk Airport. Indeed this video is not fresh one, but interesting and informative. Right Sector in heavy firefight during the battle for weather stations near Donetsk Airport.\n\n*DISCLAIMER* This footage is part of an war archive of the war in Ukraine and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Ukraine. This footage is not meant to be violent in any way."
    },
    "20": {
        "url": "https://www.youtube.com//watch?v=hgZJ_aIPJ7g",
        "description": "*DISCLAIMER* This footage is part of an war archive of the war in Iraq and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Iraq. This footage is not meant to be violent in any way. I am only sharing this footage for"
    },
    "21": {
        "url": "https://www.youtube.com//watch?v=_xjrJWi0OA4",
        "description": "*DISCLAIMER* This footage is part of an war archive of the war in Ukraine and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Ukraine. This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating. I also want to share this footage for: news reporting, sharing important information with the public, and the transformative nature of the footage."
    },
    "22": {
        "url": "https://www.youtube.com//watch?v=oUpC99V7TQk",
        "description": "Army footage as United States Armed Forces fighting in Fallujah.\nVIDEO STRICTLY HISTORICAL!!!"
    },
    "23": {
        "url": "https://www.youtube.com//watch?v=zRFNAcez-CM",
        "description": "There is the big collection of battles at the East Ukraine of the period from the beginning of summer up to winter 2015.\nThere are as new first published footages of the clashes, as well old already published on the channel footages for to make the picture of war more complete. I will make a special video of the battle of the Donetsk airport.\nThe War in Donbass (also called the War in Ukraine or War in Eastern Ukraine) is an armed conflict in the Donbass region of Ukraine. From the beginning of March 2014, demonstrations by pro-Russian and anti-government groups took place in the Donetsk and Luhansk oblasts of Ukraine, together commonly called the \"Donbass\", in the aftermath of the 2014 Ukrainian revolution and the Euromaidan movement. These demonstrations, which followed the annexation of Crimea by the Russian Federation, and which were part of a wider group of concurrent pro-Russian protests across southern and eastern Ukraine, escalated into an armed conflict between the separatist forces of the self-declared Donetsk and Luhansk People's Republics (DPR and LPR respectively), and the Ukrainian government. Prior to a change of the top leadership in August, the separatists were largely led by Russian citizens. During the summer of 2014, Russian paramilitaries were reported to make up between 15% and 80% of the combatants."
    },
    "24": {
        "url": "https://www.youtube.com//watch?v=DP_j6cRW2vw",
        "description": "Footage as Russian special forces clash with rebels in Dagestan.\nRebels hiding in dugout, located 200 meters from the village. When offered to put down your weapons, rebels began shooting. During the firefight was mortally wounded officer from special forces and killed two rebels."
    },
    "25": {
        "url": "https://www.youtube.com//watch?v=A5f8DxzZbec",
        "description": "The war in Afghanistan is the period in which the United States invaded the country after the September 11 attacks, supported initially by close allies, and eventually by the wider North Atlantic Treaty Organization, beginning in 2003. The conflict is also known as the U.S. war in Afghanistan. It followed the Afghan Civil War's 1996–2001 phase. Its public aims were to dismantle al-Qaeda, and to deny it a safe base of operations in Afghanistan by removing the Taliban from power. Key allies supported the U.S. from the start, including the United Kingdom. In August 2003, NATO became involved as an alliance, taking the helm of the International Security Assistance Force. On 28 December 2014, NATO formally ended combat operations in Afghanistan and transferred full security responsibility to the Afghan government, via a ceremony in Kabul.\nU.S. President George W. Bush demanded that the Taliban hand over Osama bin Laden and expel al-Qaeda, bin Laden had already been wanted by the U.N. since 1999. The Taliban declined to extradite him unless given what they deemed convincing evidence of his involvement in the 9/11 attacks and ignored demands to shut down terrorist bases and hand over other terrorist suspects apart from bin Laden. The request was dismissed by the U.S. as a meaningless delaying tactic and it launched Operation Enduring Freedom on 7 October 2001 with the United Kingdom. The two were later joined by other forces, including the Northern Alliance. The U.S. and its allies drove the Taliban from power and built military bases near major cities across the country. Most al-Qaeda and Taliban were not captured, escaping to neighboring Pakistan or retreating to rural or remote mountainous regions.\nIn December 2001, the United Nations Security Council established the International Security Assistance Force (ISAF), to assist the Afghan interim authorities with securing Kabul. At the Bonn Conference in December 2001, Hamid Karzai was selected to head the Afghan Interim Administration, which after a 2002 loya jirga in Kabul became the Afghan Transitional Administration. In the popular elections of 2004, Karzai was elected president of the country, now named the Islamic Republic of Afghanistan.\nIn 2003, NATO assumed leadership of ISAF, with troops from 43 countries. NATO members provided the core of the force. One portion of U.S. forces in Afghanistan operated under NATO command; the rest remained under direct U.S. command. Taliban leader Mullah Omar reorganized the movement, and in 2003, launched an insurgency against the government and ISAF.\nThough vastly outgunned and outnumbered, the Taliban insurgents, most notably the Haqqani Network and Hezb-e-Islami Gulbuddin, have waged asymmetric warfare with guerilla raids and ambushes in the countryside, suicide attacks against urban targets and turncoat killings against coalition forces. The Taliban exploited weaknesses in the Afghan government, among the most corrupt in the world, to reassert influence across rural areas of southern and eastern Afghanistan. ISAF responded in 2006 by increasing troops for counterinsurgency operations to \"clear and hold\" villages and \"nation building\" projects to \"win hearts and minds\".\nWhile ISAF continued to battle the Taliban insurgency, fighting crossed into neighboring North-West Pakistan. In 2004, the Pakistani Army began to clash with local tribes hosting al-Qaeda and Taliban militants. The US military launched drone attacks in Pakistan to kill insurgent leaders. This resulted in the start of an insurgency in Waziristan in 2007.\nOn 2 May 2011, United States Navy SEALs killed Osama bin Laden in Abbotabad, Pakistan. In May 2012, NATO leaders endorsed an exit strategy for withdrawing their forces. UN-backed peace talks have since taken place between the Afghan government and the Taliban. In May 2014, the United States announced that its combat operations would end in 2014, leaving just a small residual force in the country until the end of 2016.\nAs of 2015, tens of thousands of people have been killed in the war. Over 4,000 ISAF soldiers and civilian contractors as well as over 15,000 Afghan national security forces members have been killed. In October 2014, British forces handed over the last bases in Helmand to the Afghan military, officially ending their combat operations in the war."
    },
    "26": {
        "url": "https://www.youtube.com//watch?v=tb89p3ZfS2c",
        "description": "*DISCLAIMER* This footage is part of an war archive of the war in Ukraine and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Ukraine. This footage is not meant to be violent in any way.\nBloody War in Ukraine: January-February Footage | Compilation\nWar in Donbass - Casualties and losses:\n5,820–6,000 killed overall(including 304 foreign civilians). More than a million Ukrainians internally displaced,\nMore than 600,000 fled abroad"
    },
    "27": {
        "url": "https://www.youtube.com//watch?v=gH_RVAC_vNI",
        "description": "The 2014 Israel–Gaza conflict, also known as Operation Protective Edge and 2014 Gaza massacre, was a military operation launched by Israel on 8 July 2014 in the Hamas-ruled Gaza Strip.\nThe stated aim of the Israeli operation was to stop rocket fire from Gaza into Israel, which increased after an Israeli crackdown on Hamas in the West Bank was launched following the 12 June kidnapping and murder of three Israeli teenagers by two Hamas members. Conversely, Hamas's goal was to bring international pressure to bear to lift Israel's blockade of the Gaza Strip, end Israel's offensive, release Palestinian prisoners and overcome its political isolation, after, it is claimed, Israel was the first, on 13 June, to break the ceasefire agreement with Hamas that had been in place since November 2012.\n\nThe operation officially began the following day, and on 17 July, the operation was expanded to an Israeli ground invasion of Gaza with the stated aim of destroying Gaza's tunnel system; Israeli ground forces withdrew on 5 August. On 26 August, an open-ended ceasefire was announced. By that date, the IDF reported that Hamas, Islamic Jihad and other militant groups had fired 4,564 rockets and mortars from Gaza into Israel, with over 735 intercepted in flight and shot down by Iron Dome. Most Gazan mortar and rocket fire hit open land, more than 280 fell on areas in Gaza, and 224 struck residential areas. Militant rocketry also killed 13 Gazan civilians, 11 of them children.The IDF attacked 5,263 targets in Gaza; at least 34 known tunnels were destroyed and two-thirds of Hamas's 10,000-rocket arsenal was used up or destroyed."
    },
    "28": {
        "url": "https://www.youtube.com//watch?v=jJssD4bGl8E",
        "description": "*DISCLAIMER* This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating.\nWar in Afghanistan - Combat Footage."
    },
    "29": {
        "url": "https://www.youtube.com//watch?v=cQVj2nbUs6c",
        "description": "The 2001–2014 phase of the War in Afghanistan was the period in which the United States invaded the country after the September 11 attacks, supported initially by close allies, and from 2003 by the wider North Atlantic Treaty Organization. It followed the Afghan Civil War's 1996–2001 phase. Its public aims were to dismantle al-Qaeda, and to deny it a safe basis of operation in Afghanistan by removing the Taliban from power.\nFurther information: Withdrawal of U.S. troops from Afghanistan\nAs early as November 2012, the U.S. and NATO were considering the precise configuration of their post-2014 presence in Afghanistan. On 27 May 2014, President Barack Obama announced that U.S. combat operations in Afghanistan would end in December 2014. A residual force of 9,800 troops would remain in the country, training Afghan security forces and supporting counterterrorism operations against remnants of al-Qaeda. This force would be halved by the end of 2015, and consolidated at Bagram Air Base and in Kabul. Obama also announced that all U.S. forces, with the exception of a \"normal embassy presence,\" would be removed from Afghanistan by the end of 2016. These plans were confirmed with the signing of the Bilateral Security Agreement between the United States and Afghanistan on 30 September 2014."
    },
    "30": {
        "url": "https://www.youtube.com//watch?v=d8TFebU8TC0",
        "description": "Afghanistan War. Heavy firefight Helicopter: CH-47 Chinook, McDonnell Douglas AH-64 Apache. Compilation HD\nSupport of this video-channel is your attention! Please, use the options under the video: Like, share, subscribe, and add to your playlist. While you're watching us, we exist!"
    },
    "31": {
        "url": "https://www.youtube.com//watch?v=5xT4T0qhRB8",
        "description": "Footage of US Troops during a live fire from the M777 155mm artillery on enemy positions.\n\nThe M777 howitzer is a towed 155mm artillery piece, since 2005 successor to the M198 howitzer in the United States Marine Corps and United States Army."
    },
    "32": {
        "url": "https://www.youtube.com//watch?v=Tj3FmeYH-Oo",
        "description": "Afghanistan War. Compilation. Part 1.\nThe War in Afghanistan (2001–present) refers to the intervention by North Atlantic Treaty Organisation (NATO) and allied forces in the ongoing Afghan civil war. The war followed the September 11 attacks, and its public aims were to dismantle al-Qaeda and denying it a safe basis of operation in Afghanistan by removing the Taliban from power."
    },
    "33": {
        "url": "https://www.youtube.com//watch?v=ZieLIhPgWy0",
        "description": "Battle of Donetsk Airport | Old Terminal\nHeavy Combat Action During Assault on New Terminal in Donetsk Airport\nNovember | 2014"
    },
    "34": {
        "url": "https://www.youtube.com//watch?v=fovO_M6y1co",
        "description": "*DISCLAIMER* This footage is part of a war archive of the war in Syria and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Syria. This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating. I also want to share this footage for: news reporting, sharing important information with the public.\n\nAn intense Tank GoPro from Syria shows a mechanized SAA unit in heavy fighting with rebels while civilian cars drive right on by. \n\nSeveral SAA tanks with mounted cameras and supporting BMP’s conduct an operation in a devastated urban neighborhood. The ensuing footage captures a whole host of scenarios from incoming fire and RPG's. Once in the tight streets, the SAA begin to pummel the surrounding buildings.\n\nAfter a tank and several BMP’s cautiously cross an intersection, the final BMP is hit and forced to withdraw.\n\nSeveral fighters dash across the street from the area of the incoming fire.\n\nYou could support this channel by simply purchasing products on Amazon (link below)."
    },
    "35": {
        "url": "https://www.youtube.com//watch?v=y_R8QYskHXM",
        "description": "Ukraine War - Pro Russian Rebels In Heavy Combat Action During Clashes With Ukrainian Army in Battle of Donetsk Airport\n*DISCLAIMER* This footage is part of an war archive of the war in Ukraine and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Ukraine. This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating. I also want to share this footage for: news reporting, sharing important information with the public, and the transformative nature of the footage.\n\nThe War in Donbass (also known as the War in Ukraine or War in Eastern Ukraine) is an armed conflict in the Donbass region of Ukraine. From the beginning of March 2014, demonstrations by pro-Russian and anti-government groups took place in the Donetsk and Luhansk oblasts of Ukraine, together commonly called the \"Donbass\", in the aftermath of the 2014 Ukrainian revolution and the Euromaidan movement. These demonstrations, which followed the annexation of Crimea by the Russian Federation, and which were part of a wider group of concurrent pro-Russian protests across southern and eastern Ukraine, escalated into an armed conflict between the separatist forces of the self-declared Donetsk and Lugansk People's Republics (DPR and LPR respectively), and the Ukrainian government. Prior to a change of the top leadership in August, the separatists were largely led by Russian citizens. Russian paramilitaries are reported to make up from 15% to 80% of the combatants."
    },
    "36": {
        "url": "https://www.youtube.com//watch?v=vNqnXSNfAEg",
        "description": "*DISCLAIMER* This footage is part of an war archive of the war in Ukraine and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Ukraine. This footage is not meant to be violent in any way."
    },
    "37": {
        "url": "https://www.youtube.com//watch?v=PMmuhhBkNdQ",
        "description": "*DISCLAIMER* This footage is part of an war archive of the war in Syria and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Syria. This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating. I also want to share this footage for: news reporting, sharing important information with the"
    },
    "38": {
        "url": "https://www.youtube.com//watch?v=sCPcooQnvYk",
        "description": "*DISCLAIMER* This footage is part of an war archive of the war in Syria and should be viewed as educational. This footage is also to be taken as a raw documentary on the events of the conflict in Syria. This footage is not meant to be violent in any way. I am only sharing this footage for the purposes of news reporting and educating. I also want to share this footage for: news reporting, sharing important information with the public."
    },
    "39": {
        "url": "https://www.youtube.com//watch?v=uDTfCkqvo2M",
        "description": "The terrifyingly impressive display by the Saudi Arabian National Guard during a training event opened by Prince Muqrin, the second deputy premier + other live fire training exercises by night."
    },
    "40": {
        "url": "https://www.youtube.com//watch?v=Ry9MUR_BjNw",
        "description": "From May 22-24 U.S. Special Operations Command hosts more than 12,000 attendees in Tampa, Florida for the Special Operations Forces Industry Conference and an International SOF combined, tactical scenario driven demonstration. The live demonstration was on May 23rd from 13:30-14:00."
    }
}