{"url": "https://www.youtube.com//watch?v=nJYB6suB9dA", "description": "U.S. Air Force Special Operations Airmen (AFSOC) prepare a dirt runway for a C-130J Super Hercules landing and takeoff at an undisclosed location on June 9, 2017. Imagery has been modified to protect personally identifiable information. Unit - 75th Expeditionary Airlift Squadron.\n\nFilm Credits: SSgt Nicholas Priest"}
{"url": "https://www.youtube.com//watch?v=EbEbwO-Xkqc", "description": "U.S. Air Force F-15C Eagles from the 493rd Expeditionary Fighter Squadron conduct NATO Baltic Air Policing at Šiauliai Air Base, Lithuania on September 13, 2017. The Baltic Air Policing mission is a NATO air defense Quick Reaction Alert (QRA) in order to guard airspace over the three Baltic states of Estonia, Latvia and Lithuania. \n\nFilm Credits: SrA Elizabeth Taranto"}
{"url": "https://www.youtube.com//watch?v=1sp_zaqhr7E", "description": "During exercise Trident Juncture 18 in Norway, U.S. Marine Corps CH-53E Super Stallion Helicopters transport and insert German Infantry Troops and a Wiesel Tank near the objective. Trident Juncture 18 is the largest NATO military exercise in recent years including 31 countries and about 50,000 people. Unit - Marine Heavy Helicopter Squadron 366 (HMH-366). Filmed at Vaernes Air Base, Norway on November 1, 2018.\n\nFilm Credits: U.S. Marine Corps Video by Cpl. Paige C. Stade, 2nd Marine Aircraft Wing"}
{"url": "https://www.youtube.com//watch?v=Z_JM0GqHCFs", "description": "The V-22B Osprey can hover like a helicopter and fly like a plane.\n\nService members from, the Kingdom of Thailand, the Republic of Korea, and the United States conduct Fast Rope Insertion Extraction operations at Hat Yao Royal Thai Naval Base, Kingdom of Thailand. Filmed by Lance Cpl. Jacob A. Hug."}
{"url": "https://www.youtube.com//watch?v=0v3XDK1WKhc", "description": "Aerial refueling footage of a KC-10 Extender air tanker and EA-18G Growlers, F/A-18 Super Hornets and a B-2 Spirit bomber during exercise Northern Edge on May 23, 2019.\n\nFilm Credits: U.S. Air Force Video by SSgt Bethany La Ville, Pacific Air Forces Public Affairs"}
{"url": "https://www.youtube.com//watch?v=6wG8KFTNTsk", "description": "A brief documentary highlighting the history of Edwards Air Force Base, and the cutting-edge aircraft that have been tested and developed there."}
{"url": "https://www.youtube.com//watch?v=fRErNkYEDaE", "description": "Aircraft carriers USS Theodore Roosevelt (CVN-71) and USS Carl Vinson (CVN-70) sail together in the U.S. 5th Fleet Area of Operation (AOR), as the Vinson conducts its last flight operations before leaving. The Roosevelt with take over duties supporting Operation Inherent Resolve - conducting maritime security operations, strike operations in Iraq and Syria, and theater security cooperation efforts. Filmed on April 11-13, 2015. \n\nFilm Credits: Mass Communication Specialist 3rd Class Patrick Menah, Mass Communication Specialist 3rd Class Camilo Fernan"}
{"url": "https://www.youtube.com//watch?v=xqKInBmn5wo", "description": "U.S. Marines with the Ground Combat Element, Marine Rotational Force – Darwin (MRF-D), participate in Exercise Tafakula at Taliai Military Camp, Tonga on August 12-23, 2019. Tafakula is a multilateral exercise hosted by His Majesty’s Armed Forces of Tonga, which includes MRF-D Marines and service members from the New Caledonian Armed Forces, the New Zealand Defense Force, the Australian Defense Force and the Nevada National Guard. This exercise provides an great opportunity to develop relationships, learn about each other's cultures, and share military capabilities.\n\n\nFilm Credits: U.S. Marine Corps Video by Staff Sgt. Jordan Gilbert, Marine Rotational Force Darwin"}
{"url": "https://www.youtube.com//watch?v=4vnrcsQqspA", "description": "U.S. Marine Corps UH-1Y Huey helicopters conduct a close air support mission at night during exercise  Southern Strike 15 on Camp Shelby Joint Forces Training Center in Mississippi. Filmed on November 6, 2014. Unit - Marine Light Attack Squadron 773 (HMLA-773) Detachment A \n\nFilm Credits: SrA Robert Kingery"}
{"url": "https://www.youtube.com//watch?v=WDYZ9pzddMc", "description": "A Marines Corps KC-130J Super Hercules conducts aerial refueling with an MV-22b Osprey and an F-35 Lightening II during a training flight over Southern California on March 8, 2016. Units - Marine Aerial Refueled and Transport Squadron (VMGR) 352, Marine Medium Tiltrotor Squadron (VMM) 165, Marine Fighter Attack Squadron (VMFA) 121\n\nFilm Credits: LCpl Harley Robinson"}
{"url": "https://www.youtube.com//watch?v=2RHkxY3X8rY", "description": "U.S. Air Force F-15C Eagles and ground crews conduct a Hot Refuel/Rearming (meaning refuel/rearm while the engines are running) on the tarmac at Futenma Air Station, Okinawa, Japan on October 16, 2020.\n\nFilm Credits: Video by Staff Sgt. Daryn Murphy, 18th Wing Public Affairs"}
{"url": "https://www.youtube.com//watch?v=AHKufo0KuRE", "description": "(CLIP-1) A B-52H Stratofortress from Barksdale Air Force Base in Louisiana, lands at Eielson Air Force Base in Alaska, with drogue chute opening, to conduct Bomber Task Force operations on June 14, 2020. Bomber Task Force missions help maintain global stability by deterrence, while enabling units to become familiar with operations in different regions of the world. (CLIP-2) U.S. Marines F-35B Lightning II aircraft assigned to Marine Fighter Attack Squadron (VMFA-121) conduct flight operations at Marine Corps Air Station (MCAS) Iwakuni in Japan on July 17, 2020. VMFA-121 is the first forward deployed Marine F-35B squadron, capable of providing close air support and conducting strike missions in support of the Indo-Pacific area of operation. (CLIP-3) F-15E Strike Eagle fighter jets takeoff from Royal Air Force Lakenheath in England and share some cockpit footage before landing back on RAF Lakenheath. Filmed during Exercise Point Blank 20-3 on July 16, 2020. Exercise Point Blank sharpens combat readiness and increases tactical proficiency to maintain ready forces capable of deterring adversaries and ensuring the collective defense of the NATO alliance.\n\nFilm Credits: Video by Staff Sgt. Philip Bryant, Pacific Air Forces Public Affairs -- U.S. Marine Corps Video by LCpl. Katie Markwald, 1st Marine Aircraft Wing -- Video by Airman 1st Class Mikayla Whiteley, 48th Fighter Wing Public Affairs"}
{"url": "https://www.youtube.com//watch?v=W2-kZJuQNP4", "description": "Rapid Forge aircraft are forward deploying to train in coordination with NATO allies in Germany, the Baltics and Poland. U.S. Air Force F-35A Lighting II fighter jets assigned to the 421st Fighter Squadron and F-15E Strike Eagles, assigned to the 4th Fighter Wing, Seymour Johnson Air Force Base, North Carolina participated in Operation Rapid Forge 2019. \n\nFilm Credits: Video by Airman 1st Class Alex Miller, 52nd Fighter Wing Public Affairs -- Video by Airman 1st Class Chanceler Nardone, 52nd Fighter Wing Public Affairs -- Video by Airman 1st Class Alex Miller, 52nd Fighter Wing Public Affairs"}
