{"url": "https://www.youtube.com//watch?v=oVKybWKgkd4", "description": "Multi national forces including U.S. armor conduct offensive operations during the final days of exercise Combined Resolve II.\nExercise Combined Resolve II include more than 4,000 participants from 13 nations, including Albania, Austria, Belgium, Bulgaria, Croatia, France, Georgia, Hungary, Lithuania, Romania, Serbia, Slovenia and the U.S.\n\n►Subscribe Now -- http://bit.ly/1iAy5UG\n\n►Subscribe to our facebook page -- http://on.fb.me/1KDHp0B"}
{"url": "https://www.youtube.com//watch?v=ED3FGCNIdTI", "description": "A few video episodes as U.S. Marines demonstrate the capabilities of the new Joint Light Tactical Vehicle. \n\nCredits: U.S. Marine Corps videos by Lance Cpl. Molly Hampton, Cpl. Paul A. Ochoa, Sgt. Bryce Hodges\n\nThumbnail Credit: U.S. Army Reserve photo by Spc. John Russell / 86th Training Division\n\nDerivative works: Military Archive\n\n►Subscribe Now  -- https://www.youtube.com/channel/UCT4layPPCzgR_99g5VYYvmQ?sub_confirmation=1\n\n►Know a second language? You could help bring videos to a wider audience via the following link below -- https://www.youtube.com/timedtext_cs_panel?tab=2&c=UCT4layPPCzgR_99g5VYYvmQ"}
{"url": "https://www.youtube.com//watch?v=JhJf8toRNog", "description": "Estonian army students practiced a live fire training in the prone bipod supported, lying, kneeling and standing positions. The purpose of the course is to familiarize, improve the Soldiers accuracy, communication abilities and suppressive fire capabilities with the MG3 machine gun in order to prepare the unit for upcoming exercises.\n\nVideo Credit: Artillery Battalion, Estonian Defense Forces\n\n►Subscribe Now  -- https://www.youtube.com/channel/UCT4layPPCzgR_99g5VYYvmQ?sub_confirmation=1\n\n►Know a second language? You could help bring videos to a wider audience via the following link below: https://www.youtube.com/timedtext_cs_panel?tab=2&c=UCT4layPPCzgR_99g5VYYvmQ"}
{"url": "https://www.youtube.com//watch?v=kwrH-TTOdOk", "description": "A look inside the Leopard 2A4 tank during a live fire gunnery qualification exercise.\n\nVideo courtesy of NorthBound Expeditions\nYoutube - https://www.youtube.com/c/NorthBoundExpeditions\nInstagram - https://www.instagram.com/nb_expeditions/"}
{"url": "https://www.youtube.com//watch?v=srVfQT--cKk", "description": "Multiple video episodes of U.S. Navy Sailors during conducting live fire exercises using the Mk 38 Mod 2 machine gun system to test and maintain the ship’s defense capabilities.\n\nThe Mk 38 Mod 2 25mm MGS is a newer version of the Mk 38(M242 Bushmaster). The Mk 38 mod 2 is remotely operated and outfitted with an Electronic Optical Sight, Laser Range-Finder, FLIR, and a more reliable feeding system, enhancing the weapon system's capabilities and accuracy.\n\nCredits: U.S. Navy videos by Petty Officer 3rd Class Caleb Strong, Petty Officer 3rd Class Evan Thompson, Jeffrey M. Sherman, Petty Officer 1st Class Demetrius Kennon, Petty Officer 3rd Class Michael T. Eckelbecker, Petty Officer 2nd Class Adrienne Powers\n\nThumbnail Credit: U.S. Navy photo by Petty Officer 3rd Class Dylan M. Kinee\n\nDerivative works: Military Archive\n\n►Subscribe Now  -- https://www.youtube.com/channel/UCT4layPPCzgR_99g5VYYvmQ?sub_confirmation=1\n\n►Know a second language? You could help bring videos to a wider audience via the following link below -- https://www.youtube.com/timedtext_cs_panel?tab=2&c=UCT4layPPCzgR_99g5VYYvmQ"}
{"url": "https://www.youtube.com//watch?v=5PgsAYc6Mkk", "description": "U.S. Army service members setting up and firing a 40mm Mark-19 automatic grenade launcher aboard a vessel during a live-fire target practice training exercise at sea.\n\nThe Mk 19 grenade launcher (Mark 19) is an American 40 mm belt-fed, air-cooled automatic grenade launcher. The Mk 19 can launch its grenade at a maximum distance of 2,212 meters (2,419 yd), though its effective range to a point target is about 1,500 meters. It fires 40 mm grenades at a cyclic rate of 325 to 375 rounds per minute, giving a practical rate of fire of 60 rounds per minute (rapid) and 40 rounds per minute (sustained).\n\nCredits: U.S. Army video by Staff Sgt. Matthew Veasley\n\nThe appearance of U.S. Department of Defense (DoD) visual information does not imply or constitute DoD endorsement.\n\nDerivative works: Military Archive\n\n►Subscribe Now  -- https://www.youtube.com/channel/UCT4layPPCzgR_99g5VYYvmQ?sub_confirmation=1\n\n►Know a second language? You could help bring videos to a wider audience via the following link below -- https://www.youtube.com/timedtext_cs_panel?tab=2&c=UCT4layPPCzgR_99g5VYYvmQ"}
{"url": "https://www.youtube.com//watch?v=Ny74pZ8gxHc", "description": "B-2 Spirit aircrafts conduct local and regional training sorties and integrate capabilities with key regional partners, ensuring aircraft crews maintain a high state of readiness and crew proficiency | Compilation. Footage includes: taxi, takeoff, refueling in a flight, landing.\n\nVideo Credits: William Lewis, Airman 1st Class Susan Roberts, Staff Sgt. Benjamin Landon, Airman 1st Class Jarrod Vickers  |  United States Department of Defense\n\nThumbnail Credit: U.S. Air Force photo by Staff Sgt. Joshua Smoot\n\n►Subscribe Now  -- https://www.youtube.com/channel/UCT4layPPCzgR_99g5VYYvmQ?sub_confirmation=1\n\n►Know a second language? You could help bring videos to a wider audience via the following link below: https://www.youtube.com/timedtext_cs_panel?tab=2&c=UCT4layPPCzgR_99g5VYYvmQ"}
{"url": "https://www.youtube.com//watch?v=vc-rJD-WELk", "description": "The Patrouille de France, air demonstration team of the French Air Force, flies over Abu Dhabi, November 22, 2019.\n\nCredits: The Patrouille de France | French Air Force\n►Website - http://www.patrouilledefrance.fr\n►Instagram - https://www.instagram.com/patrouilledefrance\n►Facebook - https://www.facebook.com/patrouilledefrance.officiel\n►Twitter - https://twitter.com/PAFofficiel\n►YouTube - https://www.youtube.com/channel/UCmoNZbqQ5UFIah-7607GOUw"}
{"url": "https://www.youtube.com//watch?v=beeKX-DiLeU", "description": "From May 22-24 U.S. Special Operations Command hosts more than 12,000 attendees in Tampa, Florida for the Special Operations Forces Industry Conference and an International SOF combined, tactical scenario driven demonstration. The live demonstration was on May 23rd from 13:30-14:00\n\nVideo Credits: U.S. Special Operations Command  |  United States Department of Defense\n\nThumbnail Credit: Photo by Michael Bottoms\n\n►Subscribe Now  -- https://www.youtube.com/channel/UCT4layPPCzgR_99g5VYYvmQ?sub_confirmation=1\n\n►Know a second language? You could help bring videos to a wider audience via the fallowing link below: https://www.youtube.com/timedtext_cs_panel?tab=2&c=UCT4layPPCzgR_99g5VYYvmQ"}
{"url": "https://www.youtube.com//watch?v=cAWTKGRztBw", "description": "Compilation of 120mm mortar systems in action. U.S. Marine and U.S. Army mortar teams conduct live-fire exercises with the M327, M1129 Mortar Carrier, Soltam K6 Mortars.\n\nMortier 120mm Rayé Tracté Modèle F1 or M327 - in service with the U.S. Marine Corps as the M327 120mm Expeditionary Fire Support System is a heavy mortar of French origin. It was designed by Thomson-Brandt as the successor to the MO-120 AM-50. The RT in the designator stands for rayé, tracté, which means rifled, towed.\n\nThe Soltam K6 is a 120 mm mortar that was developed by Soltam Systems of Israel. It is the long-range version of the Soltam K5 and has replaced older systems, such as the 107-millimetre (4.2 in) M30, in several armies including the United States Army. It is much lighter than the M30, has a greater range, and can sustain a rate of fire of four rounds per minute, while the M30 could sustain only three.\n\nThe M1129 Mortar Carrier, is an 8×8 wheeled armored mortar carrier of the Stryker family of combat vehicles produced by General Dynamics Land Systems. It is in use with the United States Army.\n\nThe M106A3 mortar carrier is self-propelled artillery vehicle in service with the United States Army.\n\nVideo Credits: U.S. Army & U.S. Marine Corps  |  United States Department of Defense\n\nThumbnail Credit: U.S. Army photo by Gertrud Zach\n\n►Subscribe Now  -- https://www.youtube.com/channel/UCT4layPPCzgR_99g5VYYvmQ?sub_confirmation=1\n\n►Know a second language? You could help bring videos to a wider audience via the following link below: https://www.youtube.com/timedtext_cs_panel?tab=2&c=UCT4layPPCzgR_99g5VYYvmQ"}
{"url": "https://www.youtube.com//watch?v=BOsl5jrVOTU", "description": "U.S. Marines and Sailors conduct 24-hour flight operations in international airspace aboard the USS Wasp (LHD 1) in the Philippine Sea. Maritime prepositioning enables deployment flexibility and an increased capability to respond rapidly to a crisis or contingency with a credible presence. \n\nThe F-35B is the short takeoff and vertical landing (STOVL) variant of the aircraft. Similar in size to the A variant, the B sacrifices about a third of the A variant's fuel volume to accommodate the vertical flight system. Unlike other variants, the F-35B has no landing hook. The \"STOVL/HOOK\" control instead engages conversion between normal and vertical flight. Jet thrust is sent directly downwards during vertical flight. \n\nVideo Credits: U.S. Marine Corps Motion Imagery by Cpl. Richard Limone\n\nThumbnail Credit: Sgt. Cruz Sotelo\n\nâ–ºSubscribe Now  -- https://www.youtube.com/channel/UCT4layPPCzgR_99g5VYYvmQ?sub_confirmation=1\n\nâ–ºKnow a second language? You could help bring videos to a wider audience via the following link below: https://www.youtube.com/timedtext_cs_panel?tab=2&c=UCT4layPPCzgR_99g5VYYvmQ"}
{"url": "https://www.youtube.com//watch?v=nrsPQje_Wjo", "description": "U.S. Soldiers conduct a live-fire training exercise with the M777 towed 155mm howitzers. While deployed, Soldiers focus not only on maintaining security, but also on training to sustain, enhance, perfect skills and readiness.\n\nThe M777 uses a digital fire-control system to provide navigation, pointing and self-location, allowing it to be put into action quickly.\n\nCredit: U.S. Army video by Spc. Derek Mustard\n\nDerivative works: Military Archive\n\n►Subscribe Now  -- https://www.youtube.com/channel/UCT4layPPCzgR_99g5VYYvmQ?sub_confirmation=1"}
