{"url": "https://www.youtube.com//watch?v=GL2al0aGflI", "description": "Staff Sgt. Brian McGovern takes us to Fort Hood's Air Assault training facility to see how students are enduring tough, realistic training right here at the Great Place. Video by Staff Sgt. Brian McGovern.  10.26.2011.  Available in High Definition."}
{"url": "https://www.youtube.com//watch?v=8dcNqNSxDUg", "description": "The US Army is training Iraqi soldiers with the M16 and ACOG to become snipers.  Location:  AL QA-QAA RANGE, CAMP DEASON, IQ, 08.9.2011"}
{"url": "https://www.youtube.com//watch?v=eQon-oLeijI", "description": "Marines assigned to Mortar Section, Weapons Platoon, Company E, Battalion Landing Team (BLT) 3/2, 26th Marine Expeditionary Unit (MEU) conduct a patrol and mortar assault on the infantry platoon basic course at Fort Pickett, Va., Sept. 13, 2012. The mortar section supported the weapons platoon with 60mm mortar fire during a combined arms assault. BLT 3/2 is a reinforcement of the 26th MEU, which is slated to deploy in 2013. (Video by Cpl. Christopher Q. Stone)"}
{"url": "https://www.youtube.com//watch?v=CoQqRMqfL_g", "description": "U.S. Airmen with the 379th Expeditionary Maintenance Squadron prepare a new conventional rotary launcher for transport to be installed in a B-52 Stratofortress at Al Udeid Air Base, Qatar, Nov. 9 2017. \n\nThe CRL upgrade of the B-52s assigned to the 69th Expeditionary Bomb Squadron, will allow it to carry smart bombs within the internal bomb bay in support of Operation Freedom's Sentinel."}
{"url": "https://www.youtube.com//watch?v=x4A95BcZZw4", "description": "B-roll of Corporal Pitre demonstrates some of the skills taught in the Combat Lifesavers Course he recently went through. H&S Battalion, 1st Marine Division. Camp Pendleton, Calif. Produced by Marine Lance Cpl. Timothy J. Lenzo. Also available in High Definition.  09.02.2011"}
{"url": "https://www.youtube.com//watch?v=yPSA6DRxHGI", "description": "Marines in Helmand conducting patrols"}
{"url": "https://www.youtube.com//watch?v=Zh7WOE6mGUw", "description": "(More videos @ http://youtube.com/user/MilitaryNotes)\nMay 6th, 2012 - Marines patrol with Afghan National Army soldiers during Operation High Noon 15. The Marines partnered with 190 ANA soldiers for the three-day operation. Produced by Cpl. Timothy Lenzo. \n\nEQUIPMENT NOTES (@ 04:02):  M240G with ACOG TA648MGO-M240"}
{"url": "https://www.youtube.com//watch?v=ll-fpbu64QA", "description": "PLAYLIST:  http://www.youtube.com/playlist?list=PLD93F9AEA8B4310DB\n\nU.S. Marines with 2nd Battalion, 3rd Marine Regiment and French Airborne Marines with 8th Infantry Regiment, Company De Clerage Et D'Appius are conducting room clearing tactics on Marine Corps Base, Hawaii during Exercise AMERCAL 2011 on Oct. 3, 2011. Exercise AMERCAL 2011 is a platoon-level combat arms combined exchange between the French Armed Forces, New Caledonia and U.S. Marines with the purpose of maintaining a high level of interoperability, enhancing military-to-military relations and improving mutual combat capabilities with French allies. (U.S. Marine Corps video by Lance Cpl. Robert Bush)."}
{"url": "https://www.youtube.com//watch?v=PYPBq5cp1Aw", "description": "North Carolina Army National Guard conducting a preparatory Air Assault Course event at Camp Butner Oct. 2, 2011. This event tested approximately 28 Soldiers physical and mental ability to accomplish a variety of task identified from the U.S. Army Air Assault Course prior to them attending. Produced by Spc. Adrienne Brooks. Includes soundbites from 1st Sgt. Brian Sipe, course advisor, and Spc. Christopher Cope, air assault candidate."}
{"url": "https://www.youtube.com//watch?v=kmboDTWWe-A", "description": "The 4th Infantry Division, Task Force Ironhorse casing their colors and closing the final chapter in support of Operation New Dawn, Iraq. Soundbites from Gen. Lloyd J. Austin III, Thomasville, Ga., Maj. Gen. David G. Perkins, Keene, N.H. Produced by Staff Sgt. Rachel Coronado.  10.20.2011"}
{"url": "https://www.youtube.com//watch?v=2XyzEiuyHCM", "description": "U.S. Marines with India Battery, 3rd Battalion 12th Marine Regiment Fire a 155mm Artillery round from a M777 Howitzer in support of Artillery Relocation Training Program (ARTP) 17-3 at the Yausubetsu Maneuver Training Area, Hokkaido, Japan, Nov. 30, 2017. \n\nARTP is an annual exercise designed to help sustain and improve fire skills, occupational and common skills as well as to promote professional military educational for the overall goal of enhancing combat operational readiness and international relationships. \n\n(U.S. Marine Corps motion imagery by Lance Cpl. Richard Limone)"}
{"url": "https://www.youtube.com//watch?v=gRbZjiQVFtI", "description": "\"Best Seat in the House\" \n\nSoldiers with Bravo Company 1-52 Aviation regiment work with the Ch-47 Chinooks...a versatile aircraft for a varied mission here in Afghanistan. Sgt. Andrew Milner joined the crew in the back of the bird for the story. 10/4/11"}
