{"url": "https://www.youtube.com//watch?v=l7nKKXXik8s", "description": "When the B-21 Raider enters service in the latter half of this decade, it promises to be the most advanced stealth bomber ever to fly.\n\nHere's what we know about the B-21 Raider\nLearn More 👉 https://sbxx.us/36j55K4\n\nHow the B-21 Raider ould shift power in the Pacific\nLearn More 👉 https://sbxx.us/3aW4KiF"}
{"url": "https://www.youtube.com//watch?v=GtEkJAAMyns", "description": "The 737th Training Group revamped U.S. Air Force basic military training to inspire and develop MACH-21 Airmen. In order to achieve this goal, BMT curriculum changes improve all aspects of training across an 8.5-week program that focuses on readiness, lethality, airmanship, fitness and warrior ethos. (U.S. Air Force video by Staff Sgt. Marianique Santos)\n\nThe appearance of U.S. Department of Defense (DoD) visual information does not imply or constitute DoD endorsement."}
{"url": "https://www.youtube.com//watch?v=MDSVJfuyJlk", "description": "New technology under patent by the U.S. Navy could shift the odds in the favor of stealth aircraft: leveraging lasers to produce plasma bursts that could trick inbound missiles into thinking they’ve found a jet to chase that would actually be little more than a hologram.\n\nRead more about this cutting edge Navy Tech\nhttps://www.sandboxx.us/blog/cutting-edge-navy-tech-could-fake-fighters-ufos-using-lasers/\n\nMilitary Times Talking lasers and endless flashbangs\nhttps://www.youtube.com/watch?v=UYr3zPP5rCw"}
{"url": "https://www.youtube.com//watch?v=1yRd8fY281g", "description": "The Cold War had a way of everything needing to be bigger. When the F-106's Mach 2.3 wasn't fast enough, the YF-12 entered the scene.\n\nRead the full story here:\nhttps://sbxx.us/3zOaJUo"}
{"url": "https://www.youtube.com//watch?v=YrT0rA1YOP4", "description": "Nuclear is the most powerful weapon in the world and it requires highly trained service members to maintain, modify and repair these weapons. \nWorking in Nuclear weapons is highly technical field with study required on safety measures, workings of all components and related machinery. The hours are long but the career progression is excellent for those with a love for the job. \n\nAre you or a loved one about to become the future of the Air Force?\nStay connected at every step of the Air Force journey as well as getting training advice every week with the Sandboxx app: https://link.sandboxx.us/youtube"}
{"url": "https://www.youtube.com//watch?v=rGcPMTAQptM", "description": "Every year thousands of trainees attend Air Force Basic Military Training in the hopes of graduating and joining the United Staes Air Force. Here's a glimpse of what's in store for trainees when they arrive, and what their new life will look like. \n\nAre you considering joining the Air Force? Learn more about what your 8.5 weeks of training will look like.\nhttps://bit.ly/2FFh38U\n\n\nVideo by Staff Sgt. Josh Blackburn, Airman 1st Class Alysia Blake, Senior Airman James Crow, Senior Airman Michael Pfeiffer, Tech. Sgt. Michael Schocker and Airman Harrison Winchell\n3rd Audiovisual Squadron\n\n*The appearance of U.S. Department of Defense (DoD) visual information does not imply or constitute DoD endorsement."}
{"url": "https://www.youtube.com//watch?v=neLECMM5rsE", "description": "Special Operation Combat Control is the ultimate Jack of all trades. Over a 2 year training, you will become a FAA certified air traffic controller as well as scuba and parachute jumping certified.\nA Combat Controller's mission is to deploy without detection into hostile or remote areas and establish a base or conduct various control and communications. \nThey deploy everything from explosive to weapons to vehicles. Their motto is \"First There\" and it is a fast-paced and forever learning path within the Air Force.\n\nAssessment & Selection: How the Air Force chooses its commandos\nhttps://bit.ly/3jpH6Qr\n\nHere’s what training is like for the Air Force’s most elite operators:\nhttps://bit.ly/3hwyYMs"}
{"url": "https://www.youtube.com//watch?v=TqPTcfz2Gjc", "description": "Marine Corps Bootcamp Training Week 9 - Basic Warrior Training and Land Navigation.\n\nDownload the Sandboxx app free: https://lynm.app.link/yts\n\nGet more from Sandboxx:\nhttps://www.facebook.com/sandboxxapp/ \nhttps://twitter.com/sandboxx\nhttps://www.instagram.com/sandboxxapp/\nhttps://www.pinterest.com/sandboxxapp/\nhttp://www.sandboxx.us/\n\nSandboxx builds technology and content for our military and veteran communities. We enable members of the armed forces and their families to stay better connected throughout their military journey."}
{"url": "https://www.youtube.com//watch?v=0iIESnjbGLg", "description": "Week 5 of Air Force Basic Training is infamously known as BEAST week which stands for Basic Expeditionary Airman Skills Training. It is a simulated combat which marks the end of the Basic Military Training aspect of Basic Training. \n\nTrainees are sent to Medina Annex where they live for the week as they compete with their flights in scenario training, using what they have learnt thus far. \n\nPugil sticks and a CLAW mission all occur in this week as future airmen are put to the test on what they've learnt individually and how they operate as a team. Get training advice from former Drill Instructors and recruits delivered to your Sandboxx app every week.\n\nAre you or a loved one about to become the future of the Air Force?\n\nStay connected at every step of the Air Force journey as well as getting that training advice every week with the Sandboxx app: https://link.sandboxx.us/youtube"}
{"url": "https://www.youtube.com//watch?v=sDgMG4Ze5zg", "description": "The U.S. Air Force just started taking deliveries on Boeing's new F-15EX, but why invest in new \"old\" fighters in this era of stealth jets like the F-35 and F-22? Here's everything you need to know."}
{"url": "https://www.youtube.com//watch?v=sopPaY9zVt8", "description": "Each recruit must endure a 13-week program aimed at challenging their mental and physical toughness, as well as problem solving and interpersonal skills. These skills are not only necessary to be successful as a United States Marine, but they’re also essential to accomplishing the missions America entrusts to the Corps.\n\nLearn more about the 13 weeks of Marine Corps boot camp:\nhttps://bit.ly/3oxUEMc\n\nSee what you need to do to prepare for boot camp:\nhttps://bit.ly/36PMfh5\n\nSandboxx provides you with the content you need to be mission-ready your entire Marine Corps career. \n\nVisit us at sandboxxnews.com\nSandboxx on Facebook: facebook.com/sandboxxapp\nSandboxx on Instagram: instagram.com/sandboxxapp\nSandboxx on Twitter: twitter.com/sandboxx\n\n(Filmed and edited by LCpl Christopher McMurry)\n*The appearance of U.S. Department of Defense (DoD) visual information does not imply or constitute DoD endorsement."}
{"url": "https://www.youtube.com//watch?v=rknVvd58NGQ", "description": "During the Cold War, America developed a single air-to-air nuke that could devastate entire bomber fleets in mid-air. Thankfully, it was only ever fired in testing.\n\nRead the full article on Sandboxx News\nhttps://sbxx.us/3yHHqlP"}
