{"url": "https://www.youtube.com//watch?v=oQwIdfBmE2Q&pp=sAQA", "description": "I hand forge a traditional Scandinavian knife and carve a handle and a wooden sheath. No power tools. Open the full video description for more information.   \n\nI use a piece of coil spring from a car and ash wood from the local forrest. I am going to use the knife in future videos mainly for doing sloyd/wood carving, but also just bushcraft in general.  \n\n---------------------------\n\nMaterials: Spring steel, ash wood, cow leather, tung oil, bank line. \n\n---------------------------\n\nA few quick questions:\n\n1.What is \"puukko\"? \n\"puukko\" is Finnish and translated to English is it \"knife\"/\"belt knife\". Internationally refer \"puukko\" to a specific style of traditional Scandinavian style belt knifes. It's often internationally referred to as a \"puukko knife\" and not just \"puukko\" even though you can argue that \"puukko knife\" means if translated \"knife knife\". Adding \"knife\" just make sure that people internationally don't need to translate the Finnish word \"puukko\" before understanding it's a knife. \n\n2. Do you sell?\nNo. Don't sell anything. \n\n----------------------------------------\n\nHere can you see how I made the outdoor blacksmith shop https://www.youtube.com/watch?v=kWgESobxudc&t=86s\n\n_________________\n\nLocation: Denmark - my property. \n\n_________________\n\nVideo gear: Nikon D7000, Nikon 50 1.8, Røde videomacro, iMovie.  \n\n_________________"}
{"url": "https://www.youtube.com//watch?v=uvUGnwx5Q1M&pp=sAQA", "description": "I set up a blacksmith shop, do a walkabout in the area, use the raft, catch fish and eat some of the dried fish from part 1. Open the full video description for more information. \n\nThis is part 3 and the short version - here is the long version https://www.youtube.com/watch?v=y5r2rOjI8rw\n\nAll episodes can you see here https://www.youtube.com/watch?v=NUyDwdRkceQ&list=PLwMRed9dogc6GGAhEn1Aj66AOClYFRUl2\n\n----------------------------\n\nDate: 01-08-2019 to 02-08-2019\n\nDay: 20°C (68°F)\nNight: 10°C (50°F)\n\nLocation: Sapmi - the land of the Sami people in Norway, Sweden, Finland and Russia. Clean and remote classic northern wilderness. Fresh water rivers. Pine, spruce and birch forrest. Mountains, bears, wolves, eagles, reindeers etc. No wildlife is giving campers problems. I can't give you any information about my location, only that I am somewhere in Sapmi. You need to be the owner or get the owners permission if you want to do the same.   \n\n_________________\n\nConsuming: Water, berries and fish (cranberry, blueberry, smoked and air dried perch).\n\n_________________\n\nA few questions: \n\n1. Is the blacksmithing tools homemade? \nYes - video on the channel about how I make tongs and how I made the anvil and the hammer. No video yet on how I make bellows, but it is a future video. If you want similar do I recommend you make it your self - but it is also an option to find secondhand or pay for custom work (I don't sell anything). Example can similar anvil be found online if you google \"stake anvil\" or \"stump anvil\" or \"viking anvil\" or similar.  \n\n2. Can you give a few points about the blacksmith shop set up?\nYes. The stones closest to the fire will need replacements once in a while. The branch used as rope on the anvil stump helps prevent it wood from spritting. Used a tree as a stump because it was convenient - the tree was located just right and dying (small trees so close to big tress always struggle). The wooden pegs keeps the bellows from moving and is easy to remove and use agin or replace. The goal is to keep the fire narrow so the air you blow don't need to travel far and the sides open so the forge fit long work pieces - but before you start forging can you move around the stones to custom fit the task. Make sure the bellows don't touch the fire, you don't wan't to heat up the steel tubes. Try to make it a habit always to use both bellows. Let one blow air and one suck air at the same time. The constant blow of air makes it harder for the other tube to suck in hot air and burn or dry the leather. Ideally does only the valve take in air and not the tube. Constant blow of air also just makes the forge more efficient.\n\n3. Is the water safe to drink? \nYes. Almost all water in Sapmi can you drink straight from the source. Especially all on remote locations. It comes from the near by mountains - rain or snow/ice melting. \n\n4. What fish did you catch?\nTrout. \n\n5. Why use a stick and not a paddle for the raft?\nA stick from the tipi was the easy solution and more ideal for pushing agains the bottom of the river... In the areas where the river is too deep will a paddle work beter - but just using a stick isn't too bad.\n\n6. How did you dry the fish?\nHung them up in the tipi as raw with nothing added, no salt or anything (show it in part 1) and left them where for about two weeks. Whenever I visit the camp did I light a fire inside the tipi for adding some smoke taste and soften the bones - but most of the time was I not in the camp and the fish did just dry in the air. The air in Sapmi is in general dry and it makes air drying meat really easy. \n\n7. Was it \"chaga\" you used to carry fire?\nYes. A fungus called \"Chaga\". I use it in other videos for making tea. In this case do I use it for transporting fire.The chaga was collected near by the tipi and was only dried a few hours next to the campfire. If you want to transport fire like this do I recommend bringing along a few spare pieces so you can replace it doing the travel. One piece lasted in this case about 30 minutes. If it starts glowing too much can you just scrape some of the glowing part away.  \n\n_________________\n\nSome of the gear used:\n1. Pants = Klattermusen Gere 2.0 Regular\n2. Boots = Redback original\n3. Backpack = M39 swedish military\n\n_________________\n\nVideo gear: Canon EOS RP, Canon 50 1.8, Røde videomicpro+, Zoom h2n, iMovie.  \n\n_________________"}
{"url": "https://www.youtube.com//watch?v=ialDFkQDG1A&pp=sAQA", "description": "A day trip with canoeing in salt water and camp on the beach. Making a forge from clay and blacksmithing a steel striker. I only eat what I can gather. Open the full video description for more information.\n\nThis is the short version of the video. Here is the long version https://www.youtube.com/watch?v=FuJ0lBGM8U4 \n\n----------------------------\n\nDate: 20-06-2019\n\nDay: 25°C (77°F)\nNight: 10°C (50°F)\n\nLocation: Denmark - previous viking country. Fyn - a lot of small sea and islands, hard wood forrest. Relative remote, but a lot of people in Denmark so limited how remote it can get. A lot of birds and deer. No bears or anything dangerous for campers.\n\n_________________\n\nMost asked questions:  \n\n1. Did you do fishing?\nYes - off camera did I get the net in the water and caught a few fish. Unfortunately was it very bad video production weather most of the time and was unable to record any of the fishing. I will do a lot more fishing in fure videos. \n\n2. Was the water safe to drink? \nYes. The sea is salt water and not safe to drink. The water I am drinking is fresh water coming from the underground - it is some of the most ideal water sources. \n\n_________________\n\nSome of the gear used in the video:\n1. Pants = made by \"Klattermusen\"\n2. Boots = made by \"Redback\" original boots\n3. canoe = made by \"Bergangs\" ally 16.5\n\n_________________\n\nVideo gear: Nikon D7000, Nikon 50 1.8, Røde videomacro, iMovie.  \n\n_________________"}
{"url": "https://www.youtube.com//watch?v=NUyDwdRkceQ&pp=sAQA", "description": "I spend the summer 2019 in the northern wilderness - here is all the footage from my tipi campsite edited down to the highlights of how-to content. No talk. Open the full video description for more information. \n\nThis is a series of 5 parts, in total a few hours \"slow tv\", edited down to just 11 minutes. All episodes in full lenght can you see here https://www.youtube.com/watch?v=MRDEit1MN6s&list=PLwMRed9dogc6GGAhEn1Aj66AOClYFRUl2 \n\nNew viewers can consider using it as an appetizer/trailer. Subscribers can consider it a change to rewatch the highlights. \n\n_________________\n\nLocation: Sapmi - the land of the Sami people in Norway, Sweden, Finland and Russia. Clean and remote classic northern wilderness. Fresh water rivers. Pine, spruce and birch forrest. Mountains, bears, wolves, eagles, reindeers etc. No wildlife is giving campers problems. I can't give you any information about my location, only that I am somewhere in Sapmi. \n\nConsuming: Water (meltwater) and fish.\n\n_________________\n\nYou can find answers to all kinds of questions in the video descriptions to the full length videos. \n\n_________________\n\nA few kilometers across the river did I have a car with basic food and solar power for charging gear. I did travel back and forth in a canoe. The tipi was one of the places I did spend most of my time summer 2019.   \n\n_________________\n\nVideo gear: Canon EOS RP, Canon 50 1.8, Røde videomicpro+, Zoom h2n, iMovie.  \n\n_________________"}
{"url": "https://www.youtube.com//watch?v=vDgS-w-Be5k&pp=sAQA", "description": "Overnight trip. I finish building the lean-to camp - make fireplace and wood shead in this part. I also cook some great meat with berries. Open the full video description for more information.\n\nThis is part 3. All episodes can you see here https://www.youtube.com/watch?v=y9jIUl5tQU4&list=PLwMRed9dogc71CK8shz1fCocV5600xBKr\n\n----------------------------\n\nDate: 14-09-2019 to 15-09-2019 \n\nDay: 8°C (46,4°F)\nNight: 0°C (32°F)\n\nLocation: Sapmi - the land of the Sami people in Norway, Sweden, Finland and Russia. Clean and remote classic northern wilderness. Fresh water rivers. Pine, spruce and birch forrest. Mountains, bears, wolves, eagles, reindeers etc. No wildlife is giving campers problems. I can't give you any information about my location, only that I am somewhere in Sapmi. You need to be the owner or get the owners permission if you want to do the same.\n\nConsuming: Water (meltwater). Meat (pig) with salt, butter and cranberry. \n\n_________________\n\nA few questions:\n\n1. Why make the fire place so big?\nI will mainly be using this shelter doing winter and need a big fire so it can burn most of the night giving me a more comfortable sleep. It also offers \"table\" place. A low wall of stones is added and it will block some wind and reflect some more heat towards the shelter. Ideally would the wall be a lot taller, but choose not to as a compromise so the viewers still are able to see the fire from most of the camera angles. \n\n2. Is the wood storage waterproof? \nNo. It is only meant to provide very basic covering from the first few snowfalls - after that will snow create walls and shelter the firewood ideally. Near by is quite a few dead standing pine trees and I will just cut down what I think I need each time I visit the camp until the snow provide ideal shelter for the wood storage.\n\n_________________\n\nSome of the gear used:\n1. Pants = Klattermusen Gere 2.0 Regular\n2. Boots = Redback original\n3. Backpack = M39 swedish military\n4. Kettle = Eagle 1.5 L\n\n_________________\n\nVideo gear: Canon EOS RP, Canon 50 1.8, Røde videomicpro+, Zoom h2n, iMovie.  \n\n_________________"}
{"url": "https://www.youtube.com//watch?v=ve4ruDzQ4m8&pp=sAQA", "description": "I am enjoying a few days in the forrest. Trying a new tent and a homemade billhook. It's late winter here in Denmark and it's about -1 to +8 celcius. I am doing craft and enjoying some great food. This is the long version - here is the short version https://www.youtube.com/watch?v=-quwSgnXbn0 \n\n--------------------------------\n\nLocation: Denmark - previous viking country. West coast of Jutland - sand, big sea, spruce and pine forrest. Some of the most remote in Denmark, but a lot of people in Denmark so limited how remote it can get. A lot of birds and deer. No bears only a few wolves - nothing dangerous for campers. If you want to do the same in Denmark do you need to be the owner or get the owners permission.\n\n--------------------------------\n\nHere can you see how I made the billhook/the big knife https://www.youtube.com/watch?v=aqsGNC49jP4 \n\nHere can you see how I made the candle sticks https://www.youtube.com/watch?v=4a1mt1Kvoa4 \n\nHere can you see how I made the saw frame https://www.youtube.com/watch?v=Cl-_n2yM8c0&t=93s\n\nHere can you see how I made the drill/auger https://www.youtube.com/watch?v=fmT9IDx3bIc&t=231s\n\n---------------------\n\nA few questions:\n\nWhat are you eating?\nCabbage, eggplant, beans, onions, tomatoes - with oregano, salt and \"English sauce\". I did forget the meat at home... never done that before, but it happened this time.\n\nWhat wood did you use for making the spoon?\nOak. \n\nWas it a branch you used for the rack bindings?\nYes - green branch from pine twisted into \"rope\". You can make most wood into \"rope\" like that. \n\nWhy add moss on the table?\nKeeps the sticks better in place and no small side branches can catch what ever you lay on the table or just fall though the tabletop. .\n\nWhy didn't you do a better job on sewing the sack?\nIt's an old one, over 20 years old and the material is not strong any more. I did just quickly, while cooking the food, prevent the big hole from getting bigger. I will replace the stitches when I get home and sew all the holes with nice straight stitches - or maybe just consider if it's time to replace the sack with a new one.\n\nDid you like the billhook?\nYes, it did a fine job and I will use it more in future videos.... But I do like axes better. Having both an axe and a billhook would be very useful in a camp like this. \n\nIs it a Sami sewing kit?\nYes - homemade. \n\nWhat is that background noise?\nOnly nature sounds - I am about one mile from a big sea and that sounds sometimes similar to a highway. The rest is just wind. \n\n_________________\n\nSome of the gear used in the video:\n1. Sweaters = unknown. \n2. Pot and kettle = made by \"eagle\" 1.5 and 10 liters. \n3. Pants = made by \"Ridgeline\"\n4. Billhook = homemade. \n5. Carving tools = homemade axe, mora 106, Pfeil 8L 25mm and 7A 25mm \n6. Boots = made by \"Redback\" original boots\n7. Tent = made by \"Savotta\" 4P\n8. Backpack = made by \"Fjallraven\" Kajka 65L\n9. Sharpening stone = made by \"Gransfors Bruks\" \n10. Stove = mass production from Russia \"Poshehonka\"\n\n_________________\n\nVideo gear: Nikon D7000, Nikon 50 1.8, Røde videomacro, iMovie.  \n\n_________________"}
{"url": "https://www.youtube.com//watch?v=EWuZDHtOh1Y&pp=sAQA", "description": "Overnight trip. I continue working on the lean-to shelter - I make a wall and a raised bed in this part. I also cook some great meat and collect wild mushrooms. Open the full video description for more information.\n\nThis is part 2. All episodes can you see here https://www.youtube.com/watch?v=y9jIUl5tQU4&list=PLwMRed9dogc71CK8shz1fCocV5600xBKr\n\n----------------------------\n\nDate: 12-09-2019 to 13-09-2019 \n\nDay: 10°C (50°F)\nNight: 8°C (46,4°F)\n\nLocation: Sapmi - the land of the Sami people in Norway, Sweden, Finland and Russia. Clean and remote classic northern wilderness. Fresh water rivers. Pine, spruce and birch forrest. Mountains, bears, wolves, eagles, reindeers etc. No wildlife is giving campers problems. I can't give you any information about my location, only that I am somewhere in Sapmi. You need to be the owner or get the owners permission if you want to do the same. \n\nConsuming: Water (meltwater) and Juniper tea. Cranberry. Meat (pig) and mushrooms (boletus badius) with salt and butter. \n\n_________________\n\nA few questions:  \n\n1. Is the water safe to drink? \nYes. Almost all water in Sapmi can you drink straight from the source. All can do it and a lot do.   \n\n2. How do you know which mushrooms is safe to eat? \nOnly way to do it safely is only to collect what you recognise.... So it is all about doing some homework and getting to know a lot of mushrooms - looks, smell, taste, structure, common habitat etc. I have been on a few trips with an expert teaching me the basics a few years ago... I can recommend all to do the same, it is a lot better than books, but books is also a great tool. I am defiantly not an expert myself, but enjoy collecting the few mushrooms I know meanwhile learning to recognise more.\n\n_________________\n\nSome of the gear used::\n1. Pants = Klattermusen Gere 2.0 Regular\n2. Boots = Redback original\n3. Backpack = M39 swedish military\n4. Kettle = Eagle 1.5 L\n\n_________________\n\nVideo gear: Canon EOS RP, Canon 50 1.8, Røde videomicpro+, Zoom h2n, iMovie.  \n\n_________________"}
{"url": "https://www.youtube.com//watch?v=zR3jlITIYzY&pp=sAQA", "description": "I am enjoying an overnight on the west coast of Denmark. Making a chair with out using cord and trying an axe I made a few days ago in my blacksmith shop. I am also enjoying some great food and the comfort from wood stove and canvas tent. This is the short version of the video - here is the long version https://www.youtube.com/watch?v=Vq12kkiWxNg\n\n----------------------\n\nLocation: Denmark - previous viking country. West coast of Jutland - sand, big sea, spruce and pine forrest. Some of the most remote in Denmark, but a lot of people in Denmark so limited how remote it can get. A lot of birds and deer. No bears only a few wolves - nothing dangerous for campers. If you want to do the same in Denmark do you need to be the owner or get the owners permission.\n\n----------------------\n\nConsuming: Water, Juniperus communis tea. Bacon and onions. Cow, beans, onions, tomatoes, oregano, salt. \n\n----------------------\n\nHere can you see how I made the saw frame https://www.youtube.com/watch?v=Cl-_n2yM8c0&t=93s\n\nHere can you see how I made the Yakut knife https://www.youtube.com/watch?v=eGc_mdGBoHY\n\n---------------------\n\nA few questions:\n\nWhat is the temperature?\nJust above freezing. \n \nWhat kind of axe are you using?\nHomemade. I did just copy an old axe design I have seen in Scandinavia. I don't sell anything. \n\nWhat is that background noise?\nOnly nature sounds - I am about one mile from a big sea and that sounds sometimes similar to a highway. The rest is just wind. \n\n_________________\n\nSome of the gear used in the video::\n1. Sweater = unknown. \n2. Pot = made by \"eagle\" 10 liters. \n3. Pants = made by \"Klattermusen\"\n4. Collared axe = homemade\n5. Stove = unknown, mass production from Russia. \n6. Boots = made by \"Redback\" original boots\n7. Tent = made by \"Savotta\" 4P\n8. Backpack = made by \"Fjallraven\" Kajka 65L\n9. Sharpening stone = made by \"Gransfors Bruks\"\n\n_________________\n\nVideo gear: Nikon D7000, Nikon 50 1.8, Røde videomacro, iMovie.  \n\n_________________"}
{"url": "https://www.youtube.com//watch?v=wweJCtf464k&pp=sAQA", "description": "Making leanto shelter, beef jerky, all night fire, using a home made axe, no sleeping bag, sleeping with reindeer skins. Open the full video description for more information. \n\n3 days in hail, wind and sun on the west coast of Denmark. \n\nThis is the short version of the video - here is the long version https://www.youtube.com/watch?v=wtiorsjuc80\n\n----------------------------\n\nLocation: Denmark - previous viking country. West coast of Jutland - sand, big sea, spruce and pine forrest. Some of the most remote in Denmark, but a lot of people in Denmark so limited how remote it can get. A lot of birds and deer. No bears only a few wolves - nothing dangerous for campers. If you want to do the same in Denmark do you need to be the owner or get the owners permission.\n\n----------------------------\n\nConsuming: Water, spruce tea. Cow, salt. \n\n----------------------------\n\nA few quick questions:   \n\n1. Do you sell?\nNo. Don't sell anything. \n\n2. How long did it take to dry the meat?\nAbout 6 hours. The wind, sun and salt helps the drying go faster. \n\n3. what backpack are you using?\nA modified M39 from the Swedish military. I have used mine for years. Very common in general here in Scandinavia.  \n\n_________________\n\nSome of the gear used in the video:\n1. Sweaters = unknown. \n2. Pot = made by \"Pathfinder\" 2 liters. \n3. Pants = made by \"Klattermusen\"\n4. Axe = homemade\n5. Boots = made by \"Redback\" original boots\n6. Backpack = M39 swedish military\n\n_________________\n\nVideo gear: Nikon D7000, Nikon 50 1.8, Røde videomacro, iMovie.  \n\n_________________"}
{"url": "https://www.youtube.com//watch?v=bwBphhv6hc0&pp=sAQA", "description": "Overnight in tipi. I use amadou from the tinder fungus to make flint and steel tinder for fire lightning. Make a tripod with a branch as rope for cooking. Make a table from logs by drilling holes and using wedges, no rope. I also enjoy some fish over campfire and the fact that the permanent bushcraft cramp is starting to be well established. Open the full video description for more information.\n\nThis is part 5. All episodes can you see here https://www.youtube.com/watch?v=NUyDwdRkceQ&list=PLwMRed9dogc6GGAhEn1Aj66AOClYFRUl2  \n\n----------------------------\n\nDate: 26-08-2019 to 27-08-2019 \n\nDay: 10°C (50°F)\nNight: 8°C (46,4°F)\n\nLocation: Sapmi - the land of the Sami people in Norway, Sweden, Finland and Russia. Clean and remote classic northern wilderness. Fresh water rivers. Pine, spruce and birch forrest. Mountains, bears, wolves, eagles, reindeers etc. No wildlife is giving campers problems. I can't give you any information about my location, only that I am somewhere in Sapmi. Location: Sapmi - the land of the Sami people in Norway, Sweden, Finland and Russia. Clean and remote classic northern wilderness. Fresh water rivers. Pine, spruce and birch forrest. Mountains, bears, wolves, eagles, reindeers etc. No wildlife is giving campers problems. I can't give you any information about my location, only that I am somewhere in Sapmi. You need to be the owner or get the owners permission if you want to do the same.  \n\nConsuming: Water (meltwater) and fish (pike).\n\n_________________\n\nA few questions:  \n\n1. How did you make the tinder?\nBy boiling the \"amadou\" layer from the \"tinder fungus\" in about 50/50% wood ashes and water for about 1 hour. Amadou is a layer next to the outside hard shell on the fungus. All hard wood ashes can be used, but birch ashes should be some of the most ideal. You can cut off the amadou or you can, like I do in the video, make the fungus softer by boiling and separate it by hitting and or pulling. You can use green or dry tinder fungus - just try to avoid the rotten once (the one I use in the video is close to be to rotten). I can't tell you why it works - but it makes the amadou a hundred times easier to use for fire lightning. In my area of the word have tinder fungus been used as the main tinder long before the viking age and way after the vikings. The tinder I made in the video will be enough for lighting a few hundred campfires. \"Tinder fungus\" is a specific fungus growing on hardwood trees and very common in my part of the world. other names for the fungus is \"Horse's Hoof Fungus\", \"Fomes fomentarius\" and \"Hoof Fungus\".  \n\n2. Is the water safe to drink? \nYes. Almost all water in Sapmi can you drink straight from the source. All from remote locations. It comes from the near by mountains - meltwater.   \n\n_________________\n\nSome of the gear used:\n1. Pants = Klattermusen Gere 2.0 Regular\n2. Boots = Redback original\n3. Backpack = M39 swedish military\n\n_________________\n\nVideo gear: Canon EOS RP, Canon 50 1.8, Røde videomicpro+, Zoom h2n, iMovie.  \n\n_________________"}
{"url": "https://www.youtube.com//watch?v=NBvFJKC6I8Y&pp=sAQA", "description": "7 days in Denmark together with Morten Hilmer - 4 camps in hardwood forrest next to lake and sea. Open the full video description to read more. \n\nMorten Hilmer's video from the trip https://www.youtube.com/watch?v=kYqEK4RFKUM&t=5s\n\n----------------------------\n\nDate: November 2020 \n\nDay: 11°C (52°F)\nNight: 2°C (36°F)\n\nHours of daylight = 7.5 \n\nLocation: Scandinavia, Denmark - previous viking country. North Jutland - sea, spruce/pine and hardwood forrest. Some of the most remote in Denmark, but a lot of people in Denmark so limited how remote it can get. A lot of birds and deers etc. No bears, only a few wolves - nothing dangerous for campers. If you want to do the same in Denmark you need to be the owner or get the owners permission.\n\n_________________\n\nConsuming: Water, juniper tea, bread, duck, oysters, soup with duck meat, raw cow meat, dried sheep meat.  \n\n_________________\n\nA few questions:  \n\n1. Who is Morten Hilmer?\nA nature photographer from Denmark and a dear friend of mine. Morten is specialised in Arctic and Nordic wildlife. I am currently living together with Morten on his farm in Northern Jutland. Morten has filmed some of the footage in this video. \n\n2. What kind of bread were you baking? \nIn Danish is it called \"snobrød\" which can be translated into \"twisted bread\". It is a very common method in Denmark. Some of the benefits of \"snobrød\" is that you can watch the bread during the baking process to make sure nothing gets overbaked and the simplicity of not needing any cooking gear. \"Snobrød\" is also very quick to bake, only about 15 minutes.      \n \n3. Did you catch any fish?\nNo. Pike was the goal, but no luck.  \n\n4. It has been a year since your last video... What have you been up to?\nSorry. I have spent the time learning more craft - mainly log cabin building and old constructions of forge welded axes. \n\n_________________\n\nSome of the gear used in the video:\n1. Pants = made by \"Klattermusen\"\n2. Boots = made by \"Redback\" original boots\n3. Tent = made by \"Tentipi\" Safir 9\n4. Knife and axe = homemade\n\n_________________\n\nVideo gear: Canon EOS RP, Canon 50 1.8, Røde videomic pro+, iMovie.  \n\n_________________"}
{"url": "https://www.youtube.com//watch?v=Yyi5hz9iMaQ&pp=sAQA", "description": "5 days in Denmark together with DonVonGun and Morten Hilmer - basecamp in hardwood forrest. Open the full video description to read more. \n\nDonVonGun's video from the trip https://www.youtube.com/watch?v=0FSw4AlNPKw\n\nMorten Hilmer's video from the trip https://www.youtube.com/watch?v=kUv0l-KHAss\n\n----------------------------\n\nDate: April 2021 \n\nDay: 8°C (46.4°F) \nNight: 0°C (32°F)\n\nHours of daylight = 14 \n\nLocation: Scandinavia, North Denmark - sea, spruce/pine and hardwood forrest. Some of the most remote in Denmark, but there are a lot of people in Denmark, so limited how remote it can get. A lot of birds and deers etc. No bears, only a few wolves - nothing dangerous for campers. If you want to do the same in Denmark do you need to be the owner or get the owners permission.\n\n_________________\n\nConsuming: Water, juniper tea, birch sap, beer, bread, oysters, cow and pig meat\n_________________\n\nA few questions:  \n\n1. Who is Morten Hilmer?\nA nature photographer from Denmark and a dear friend of mine. Morten is specialised in Arctic and Nordic wildlife. I am currently living together with Morten on his farm in Northern Jutland (Denmark). Here can you see his youtube channel https://www.youtube.com/user/MortenHilmer \n\n2. Who is DonVonGun? \nA skilled bushcrafter from Denmark and a dear friend of mine. Don was one of the main people who introduced me to bushcraft. He also was my main inspiration when I made my first youtube bushcraft video. Here can you see his youtube channel https://www.youtube.com/user/sorenanker \n\n3. What tent and stove are you using? \nThe tent is made by \"Tschum\" and is the 4P light version https://tschum.de/product_info.php?info=p34_tschum-4p-light-katun.html \nThe Stove is a Poshehonka size M, basic version https://tschum.de/product_info.php?info=p71_poshehonka-stove-set-m---basis-version.html  \n\n4. It has been a while since you're last video - what have you been up to?  \nSorry. I have spend the time working on a new blacksmith shop in Denmark and planning future wilderness trips. If covid-19 allows it will I soon travel back to Sapmi and the YouTube channel will be back to normal with trips and blacksmithing etc. \n\n_________________\n\nSome of the gear used in the video:\n1. Pants = made by \"Klattermusen\"\n2. Boots = made by \"Redback\" original boots\n3. Tent = KATUN 4P Light, made by \"Tschum\"\n4. Wood stove = Poshehonka M basic\n5. Axe and carving tools = homemade \n\n_________________\n\nVideo gear: Canon EOS RP, Canon 50 1.8, Røde videomic pro+, iMovie, 13\" MacBook Air M1 2020.  \n\n_________________"}
{"url": "https://www.youtube.com//watch?v=Vq12kkiWxNg&pp=sAQA", "description": "I am enjoying an overnight on the west coast of Denmark. Making a chair with out using cord and trying an axe I made a few days ago in my blacksmith shop. I am also enjoying some great food and the comfort from wood stove and canvas tent. This is the long version of the video - here is the short version https://www.youtube.com/watch?v=zR3jlITIYzY\n\n----------------------\n\nLocation: Denmark - previous viking country. West coast of Jutland - sand, big sea, spruce and pine forrest. Some of the most remote in Denmark, but a lot of people in Denmark so limited how remote it can get. A lot of birds and deer. No bears only a few wolves - nothing dangerous for campers. If you want to do the same in Denmark do you need to be the owner or get the owners permission.\n\n----------------------\n\nConsuming: Water, Juniperus communis tea. Bacon and onions. Cow, beans, onions, tomatoes, oregano, salt. \n\n----------------------\n\nHere can you see how I made the saw frame https://www.youtube.com/watch?v=Cl-_n2yM8c0&t=93s\n\nHere can you see how I made the Yakut knife https://www.youtube.com/watch?v=eGc_mdGBoHY\n\n---------------------\n\nA few questions:\n\nWhat is the temperature?\nJust above freezing. \n \nWhat kind of axe are you using?\nHomemade. I did just copy an old axe design I have seen in Scandinavia. I don't sell anything. \n\nWhat is that background noise?\nOnly nature sounds - I am about one mile from a big sea and that sounds sometimes similar to a highway. The rest is just wind. \n\n_________________\n\nSome of the gear used in the video:\n1. Sweater = unknown. \n2. Pot = made by \"eagle\" 10 liters. \n3. Pants = made by \"Klattermusen\"\n4. Collared axe = homemade\n5. Stove = unknown, mass production from Russia. \n6. Boots = made by \"Redback\" original boots\n7. Tent = made by \"Savotta\" 4P\n8. Backpack = made by \"Fjallraven\" Kajka 65L\n9. Sharpening stone = made by \"Gransfors Bruks\"\n\n_________________\n\nVideo gear: Nikon D7000, Nikon 50 1.8, Røde videomacro, iMovie.  \n\n_________________"}
