{"url": "https://www.youtube.com//watch?v=TBxlxI0QJrk&pp=sAQA", "description": "Get your free 30 day trial here \n\nhttp://www.audible.com/robinet. \n\nThis is PT2...I travel north to explore a new area, I hike in for 3 hours, test out a new bushcraft type backpack, make a bowdrill kit, sleep in a hammock, and ride out a thunderstorm under a tarp.\n\nInstagram https://instagram.com/joerobinetbushcraft/\nTwitter https://twitter.com/Robinet_Joe"}
{"url": "https://www.youtube.com//watch?v=4p-qiFdj0kg&pp=sAQA", "description": "Go to squarespace.com/joerobinet and use promo code JOEROBINET for 10% off your first launch!\n\nJoin me on an amazing campout in the most remote, northern location I've ever shot a video at.\nI get dropped off alone by a fishing boat, on a remote northern Island in the Northwest Territories in remote Canada, left by myself to last the day and night.\nI go on a huge hike to find a suitable spot to fish, I pull out about 7 or 8 small lake trout, I keep one for an epic catch and cook.\nI sit by the campfire, and relax at night.\n\nInstagram https://instagram.com/joerobinetbushcraft/\nTwitter https://twitter.com/Robinet_Joe"}
{"url": "https://www.youtube.com//watch?v=S51QxySnThc&pp=sAQA", "description": "Went out with the dog this morning to make myself some breakfast, and play with a new axe that I got recently."}
{"url": "https://www.youtube.com//watch?v=cV0DXKQFsk8&pp=sAQA", "description": "It was a very nice day yesterday, so after work I grabed some gear and my dog, we went and spent the night in the woods, while there I completed a Bushclass assignment...make and use 3 different fire lay configurations."}
{"url": "https://www.youtube.com//watch?v=cfbhJZPILhA&pp=sAQA", "description": "Same stuff you have come to expect from me, only this time I am up north in a Pine forest."}
{"url": "https://www.youtube.com//watch?v=NpMh50BvVTY&pp=sAQA", "description": "This is the first video I've shot in a while.\nI'm very excited about this video, I had a really fun day out.\nIve always wanted to put my canoe on a side x side and explore the area.\nin this video, I explore a creek, catch brook trout and have a catch and cook lunch over the fire.\nNew videos soon!\nThanks to Polaris for the use of the Ranger side x side! https://ranger.polaris.com/en-ca/\nNew Merch here! https://www.bunkerbranding.com/pages/joe-robinet\nInstagram https://instagram.com/joerobinetbushcraft/\nhttps://twitter.com/robinet_joe\nFull Revolution Race gear as always link here https://bit.ly/JoeRobinet-RR\nhindsight4wheeling ig account https://www.instagram.com/hindsight4w​..."}
{"url": "https://www.youtube.com//watch?v=sQlQXYrE4UI&pp=sAQA", "description": "Watch in 1080!\nClick \"Show More\" for a ton of info and links.\nThis video is a bit different than my normal videos.\nI really just wanted to relax and have fun on this trip, there is really not too much of a storyline with this one, mostly clips of us joking around, and it really has no end, but It is a fun little video, I think you guys will enjoy.\nCanoing Camping Bushcraft Fishing Big Agnes Wildcamp \nConnect with me.\nBushcraft Courses http://www.northgatebushcraft.com/\nMy website http://joerobinetbushcraft.com/\nFacebook https://www.facebook.com/joerobinetbushcraft\nInstagram https://instagram.com/joerobinetbushcraft/\nTwitter https://twitter.com/Robinet_Joe"}
{"url": "https://www.youtube.com//watch?v=PlK2bokUuqQ&pp=sAQA", "description": "Scout and I went to our favorite place in the county today after work. I felled a tree, did some massive fire prep, set up a ridgepole, and cooked a tasty dinner.\n\nHope you enjoy"}
{"url": "https://www.youtube.com//watch?v=reV1WaPaSm8&pp=sAQA", "description": "#bushcraft #steak #joerobinet\nNew Merch here! https://www.bunkerbranding.com/pages/joe-robinet\nYet another overnight bushcraft camp! this time I use an oilskin tarp sent to me by @bushcraftspain I also use a wool blanket and a long fire for warmth.\nI build a spruce bough bed and cook a caveman steak on the coals\noh ya, there is a pack giveaway!\nInstagram https://instagram.com/joerobinetbushcraft/\nhttps://twitter.com/robinet_joe"}
{"url": "https://www.youtube.com//watch?v=0xKPzcQeqlo&pp=sAQA", "description": "#bushcraft #joerobinet #solo \nGet 30% OFF your first bag of coffee with Trade Coffee when you click here: https://cen.yt/tradejoerobinet\nNew Merch here! https://www.bunkerbranding.com/pages/joe-robinet\nCome alond with me on day 3 and episode 2 of a 5 day solo bushcraft adventure.\nin this ep I find all natural fat wood and build a fire with it. I talk about and drink chage tea...there is a little exploration in between lakes and I make an awesome improvised pot hanger.\nthere will only be one more episode in this series.\nInstagram https://instagram.com/joerobinetbushcraft/\nhttps://twitter.com/robinet_joe"}
{"url": "https://www.youtube.com//watch?v=80f876LESSM&pp=sAQA", "description": "JULY 18-20...NOT AUG.\nMyself and a friend set out, each in our solo canoes, for a 3 day, 2 night adventure that would take us through a couple small lakes, and two long stretches of the Nipissing and Tim Rivers.\n\nShawn's Channel https://www.youtube.com/channel/UCIMXKin1fXXCeq2UJePJEog\n\nMy canoe http://www.swiftcanoe.com/#!adirondack-pack-136/c1u96\n\nInstagram https://instagram.com/joerobinetbushcraft/\n\nTwitter https://twitter.com/Robinet_Joe"}
