{"url": "https://www.youtube.com//watch?v=vAuO3bHxSpc&pp=sAQA", "description": "I built a round hut using palm thatch and mud walls to replace the damaged A-frame hut built a few months ago. The A frame hut was damaged due to torrential rain and poor design elements considering the wet conditions. The thatch had rotted in the part of the roof that gets shade. Moth larvae and mold grew and consumed the thatch in these places. The hut also tilted forward due to the back post being hammered in only 25 cm into the ground. So on returning to the property (it was cut off by flooded bridge) I began work on a new hut.\nThe new hut was positioned further into the open clearing to get more sunlight. A 3 meter diameter circle was scribed and 12 wooden posts were hammered into the ground, each 50 cm deep for a sturdier structure. Lintels were then tied to the top of the posts joining the posts together. A tripod ladder was made from poles lashed together at the top and a platform lashed to its frame. The roof poles were then attached to the top of the lintels and lashed together at the top to form a conical roof frame, 3 meters at the highest point. Loya cane was then tied on the eaves to act as support for the ends of the palm thatch. \n700 palm fronds were then cut split and thatched onto the roof. The tripod ladder was used to climb up and thatch the roof from the inside. A cap was then made to put on the very top of the cone when the roof was almost finished.\nA drainage moat was dug around the hut and the excavated soil was placed on the hut floor to raise its level above the damp ground. A deluge tested the hut’s water shedding abilities. Torrential rain fell while a fire was kept going inside the dry hut. The drainage moat flowed like a stream during the heavy rain event. \nLoya cane was then harvested and woven between the posts. This formed a low wall. It was then daubed with mud inside and out. The clay from this was taken from the drainage moat. Rain falling into the moat meant that water didn’t need to be collected from the stream to mix the mud. This is another benefit of the drainage moat.\nThe low wall allows light and air into the hut. With a fire going in the central pit, mosquitoes are kept at bay. The central fire pit produces smoke and heat that will hopefully prevent moths laying eggs in the roof (the caterpillars of which eat thatch) and will prevent mold from growing. The hut will be used as an undercover work space for future projects.\nWordpress: https://primitivetechnology.wordpress.com\nPatreon page: https://www.patreon.com/user?u=2945881\nI have no face book page, instagram, twitter etc. Beware of fake pages."}
{"url": "https://www.youtube.com//watch?v=JgQ-07VgJuY&pp=sAQA", "description": "I made a blower and some charcoal at the new area in order to create higher temperatures in for advancing my material technology. I took Fan palm leaves and fashioned them into an impellor (about 25 cm in diameter) held in a split stick as a rotor. I then built a housing from clay (slightly more than 25 cm diameter with inlet and outlet openings about 8cm in diameter) and assembled the blower. I opted not to make a bow or cord mechanism as I’ve done before due to the complexity and lower portability of such a device. The lighter impellor material (leaf instead of the previous bark) made it easier to spin by hand anyway as it has a lower momentum. Each stroke of the spindle with the hand produces 4 rotations, so about 2 strokes per second gives 480 rpm. The blower increases the heat of a fire when blowing into it and I would guess it’s more effective than a blow pipe and lungs but don’t how it would compare to a primitive pot or bag bellows for air supply. A small furnace was made and then fired with wood fuel. The wood was wet but managed to fuse and partially met sand in the furnace. \nTo get better performance, I made charcoal from the poor quality wood. I made a reusable charcoal retort to make it. This was different from the previous reusable mound I built as it consisted of a mud cylinder with air holes around the base. To use, it was stacked with wood and the top was covered with mud as opposed to the previous design which had a side door. The fire was lit from the top as usual and when the fire reached the air entries at the base (after an hour or two) the holes were sealed and the mound left to cool. The top was the broken open the next day and the charcoal removed. Another batch was made using significantly less effort as the main structure of the mound did not need to be rebuilt each time, only the top.\nIron bacteria was again used to test the furnace. Charcoal and ore was placed in the furnace and the blower utilised. After an hour of operation the furnace was left to cool. The next day the furnace was opened and only slag was found with no metallic iron this time. I think increasing the ratio of charcoal to ore might increase the temperature so that the slag flows better. Further experiments will be needed before I get used to the new materials here.\nThe new area I’m in is significantly wetter than the old area and this has affected the order in which I create my pyro technology. The old spot was a dry eucalypt forest with an abundant source of energy dense fire wood. As a result, I developed kilns early on, powered with wood fuel and a natural draft, before developing charcoal fuelled forced air furnaces. In contrast, the new area is a wet tropical rainforest, where wood rots nearly as soon as it falls off the tree in the damp conditions. Wood is also more difficult to collect here because of hordes of mosquitoes (away from the fire) and unpleasant, spiky plants. Because of this I developed a forge blower first as it allows higher temperatures from a lower quantity and quality of fuel. \nThis poor quality wood can further be improved by converting it to charcoal first. In future, it may be necessary to cut fire wood green and dry it as opposed to picking it up off the ground dead as was preferable in the Eucalyptus forest I came from. The blower is also handy for stoking a tired campfire back into flames, I simply scrape the coals into a small mound around the nose of the tuyere and spin the impellor. I use the blower each day I’m at the hut for this purpose to save blowing on hot coals each time I need a fire for something. \nWordpress: https://primitivetechnology.wordpress.com\nPatreon page: https://www.patreon.com/user?u=2945881\nI have no face book page, instagram, twitter etc. Beware of fake pages."}
{"url": "https://www.youtube.com//watch?v=Ka2Eu6LxAKo&pp=sAQA", "description": "Primitive Technology: Grass thatch, Mud hut - Creating a grass thatch, mud hut from scratch.\nSubscribe: http://bit.ly/subPT | Never miss a video! Enable ‘ALL’ Notifications!\nMore videos, watch me make stone yam planters: https://youtube.com/watch?v=1Ph_ORewpE0&list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n\nWatch More Primitive Technology:\nLatest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1\n\nAbout This Video:\nWith the wet season at it's peak, a shelter was needed to keep tools and materials dry as well as providing a dry work-space for future projects. So after some procrastination, I decided on a low roof design. A 2.5 m by 2.5 m hut with a ridge 2 m above the ground and side walls 75 cm high. Upright posts were put in at about 60 cm intervals along the 3 walls. The front was left open  as this is more of an open workshop than a dwelling.  Grass was collected from high up in the hill as it will not grow in the darker, lowland forest. Carrying the thatch to the hut was the most labor intensive part taking approximately 36 hours over the course of more than a week.  The walls were then coated in soft, grey mud from a nearby clearing. The floor was coated in the same material. A large amount of rain fell due to a nearby tropical cyclone passing to the north. Despite this there were only a few leaks (mainly on the ridge line) that were subsequently patched with more grass. A fire was then lit with fire-sticks despite the damp conditions. This was done to help dry the mud walls and floor. The end of the video shows the yam mounds behind the hut doing well from of the torrential rain. The shelter will suffice for the remaining two months of rain that is expected to fall.\n\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber."}
{"url": "https://www.youtube.com//watch?v=BN-34JfUrHY&pp=sAQA", "description": "The manufacture of a stone ax including the handle from using  only primitive tools and materials. It is a celt (pronounced \"selt\") a type of ax with a polished stone head wedged into a hole or mortise at the end of a wooden handle (not to be confused with a \"Kelt\" referring to a Celtic person). The head took about a week and a day to make as I chose to make it from a particularly large piece of basalt. The hammer stone used to shape the basalt was of quartz. This involved hammering, pecking, grinding and polishing the head into the final shape. The handle took a day and a morning to make. A chisel was made from stone and a mallet made from a log. These were used to cut the tree for the handle and shape it once down. Fire was used to harden the wood and also to help shape the mortise. The ax was then used to cut down a tree the day after the handle was a tree itself. It is a more efficient tool for felling trees than the hand ax I made and at the time of uploading this video has cut down 4 trees which I will use later. Because this stone axe is blunter than a steel one, the blade needs to hit the tree at angles greater than 45 degrees- otherwise the blade would glance off. So celts were used more like wedges than modern axes.\n\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon page: https://www.patreon.com/user?u=2945881&ty=h\nI have no face book page. Beware of fake pages."}
{"url": "https://www.youtube.com//watch?v=lMZY_9QNe4I&pp=sAQA", "description": "Primitive Technology: Polynesian Arrowroot Flour - Creating Polynesian arrowroot flour from scratch.\nSubscribe: http://bit.ly/subPT | Never miss a video! Enable ‘ALL’ Notifications!\nMore videos, watch me build stone planters for Yams from scratch: https://youtube.com/watch?v=1Ph_ORewpE0&list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n\nWatch More Primitive Technology:\nLatest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1\n\nAbout This Video:\nI gathered polynesian arrowroot, grated it, extracted and dried the starch and cooked it into gelatinous, pancake shaped food that tasted like rice noodles. Polynesian arrow root is a plant in the same family as yams but with a different growth habit. It has a single, branching leaf and a single tuber below ground. They were brought to Australia about 5000 years ago as one of the \"canoe\" plants carried by Polynesian seafarers and grow wild in the hills near my hut to this day. The tubers are rich in starch but have a bitter compound that needs to be leached out with water to be made edible. This same compound is traditionally a medicine in small quantities for treating a range of illnesses from gastrointestinal upset to snake bite.  I dug up the tubers which took about 3 minutes to do per plant, yielding one golf ball sized tuber each. These were then washed and grated into a pot using a roof tile. The resulting mash was mixed with water and allowed to settle. The white milky water was then scooped into a second pot and the starch was allowed to settle. The water was then poured off and more starch water was tipped in. At this stage the starch was still bitter, so it was mixed with water, allowed to settle and the clear water above was poured off several times removing this bitterness. When it tasted good, the paste was put onto a tile to dry over a fire. Some of it cooked and became small rubbery pieces of starch. The dry flour was stored in a pot. Some of this was then mixed into a paste and cooked on a tile like a pancake. It turned clear when cooked and has a rubbery texture. It tasted just like a rice noodle which is unsurprising considering the ingredients are nearly the same. Starch is the largest carbohydrate in the human diet. Polynesian arrowroot starch contains 346 calories per 100 g (wheat contains 329) and so the discovery of this staple food is fairly significant. It can be stored indefinitely if kept dry and away from weevils or can be stored as live tubers for six months (then they begin to sprout and should be planted). The live tubers bitterness means animals will not eat them which is good for storage. I may cultivate some in a small plot in the hills near where I dug them up. They are numerous in the wild but may produce more if the soil is tilled.\n\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber."}
{"url": "https://www.youtube.com//watch?v=KzMfeQyY5xM&pp=sAQA", "description": "This is an old hut I built 2 years ago and have since demolished. It was a 2 m square floor with wattle and daub walls 1.5 m high topped with a pyramidal roof thatched with Alexander palm fronds. The building method is my usual plan- get a roof up first then build the walls. From start to finish it took 27 days (it could have been faster though- this was at a casual speed). This was the first wattle and daub hut I built and is larger than the other one I built later (my idea for now is to build small but well although I'll try larger huts again in future). \n\nThe roof lasted for a few months before becoming rotten and bug eaten. As an important note the species of palm used in thatching makes all the difference. Had this hut been built in the mountain with wait-a-while palm fronds it would have lasted 2 years at least. \nInstead it was thatched with alexander palm fronds that deteriorated quickly.\n\n I wasn't to know this and was trying to adapt hut building practice I learned in the mountain to low land conditions (I've built similar huts up the mountain with the same roof shape that have lasted a long time). I hope in future videos to explore better roofing options to use in  areas like this.\n\n Also of interest in the video is another pot I make showing more detail than previous videos. The fire place for the hut is a simple pit in the center of the floor. It is a good hut design though it requires a simple ladder to construct.\nPrimitive Technology Blog: https://primitivetechnology.wordpress...\n\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon page: https://www.patreon.com/user?u=2945881&ty=h\nI have no face book page. Beware of fake pages."}
{"url": "https://www.youtube.com//watch?v=TTcXhYHmOx8&pp=sAQA", "description": "I built a fenced enclosure and cultivated sweet potatoes (from civilisation) and yams (from the wild) in it. I originally had a small 3X3 m garden behind the wattle and daub hut that already had some sweet potato and yam vines growing in it that were planted after the hut was built. But wallabies kept eating the leaves. So I made a wattle enclosure around it to keep them out.  Wood ash was added to the soil to provide potassium and phosphorus for the growing tubers. \nThe previous small garden was organised in rows (not seen in this video) but this was hard to water during dry weather. So I re-organised the patch into 1 meter wide mounds with pits in the centre. Vines were planted into the mounds and water poured into the centre of each mound watered the vines. So then I had a small garden with 9 mounds contained within it. I decided to enlarge the patch to fit in more mounds so I took out 2 sides of the fence and extended them by a meter each. So the patch ended up being 4X4m and contained 16 mounds. In addition to wood ash, leaf mould was added to the mounds for fertility and to reduce loss of moisture.\nThe patch, being in the dark forest understory, received only about 2-3 hours of direct sunlight per day so the yield was disappointingly small. Nevertheless, the patch produced a few small sweet potatoes and a single larger yam. I also picked some green growing tips of the sweet potato vine that can also be eaten. I boiled the greens slightly in a pot with a hot stone and ate the leaves. I then roasted the sweet potatoes and yam in the coals of the fire. The sweet potatoes (purple fleshed tuber) taste sweet and starchy whereas the yam (white fleshed tuber) tastes similar to an ordinary potato. After eating, I took the wood ash from the fire and poured it back into the mounds that were harvested, replanted them and watered them. In future I’d plant the sweet potatoes in an area that receives much more sunlight in order to dramatically increase production. I’ve grown the same variety at home and it produces a much greater quantity and size of tubers in full sun. Wood ash also tends to increase tuber yield and so is a good use for waste ash.\nThe sweet potato is a remarkable plant. It’s a staple food of many traditional cultures. NASA has considered it a potential crop to be grown on spaceships for long term missions. In terms of energy production it’s only 3rd behind sugar cane and cassava. It produces the most food value (a combination of edible energy and nutrition) of any crop per unit space and time. A study of Fijian farms using manual labour showed that ratio of energy put into farming vs yield of energy was 1:17 for rice and 1:60 for sweet potato.  It grows on marginal soil and doesn’t require much nitrogen to grow. It takes a relatively short growth period of 3-4 months to yield. All parts of the plant can be eaten including the leaves which provide additional protein and nutrients.  I grow the purple variety (because it tastes better in my opinion) but all varieties are nutritious and will stave off malnutrition. A person could potentially be nearly self-sufficient from a small plot of sweet potatoes. Note that in colder climates, regular potatoes could be grown instead of sweet potatoes.\n\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon page: https://www.patreon.com/user?u=2945881&ty=h\nI have no face book page. Beware of fake pages."}
{"url": "https://www.youtube.com//watch?v=RnvtXikwrIU&pp=sAQA", "description": "Join me for my first Reddit AMA on Friday 1st November 9am BST / 6pm AEST. My username is u/JohnPlant. The AMA will be on the “r/IAmA” subreddit. \nOrder book: http://po.st/PrimTechBook\nPrimitive Technology: Crossdraft kiln - Building a crossdraft kiln from scratch.\nSubscribe: http://bit.ly/subPT | Never miss a video! Enable ‘ALL’ Notifications!\nLast time, I made Polynesian Arrowroot Flour from scratch: https://youtube.com/watch?v=lMZY_9QNe4I&list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n\nWatch More Primitive Technology:\nLatest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1\n\nAbout This Video:\nI built a cross draft kiln and fired a pot in it to test ideas about how cross draft kilns operate. A cross draft kiln is one in which the flames travel from the firebox and across a horizontal wear chamber before traveling vertically up a chimney and out of the kiln. Unlike an updraft kiln there is no perforated floor that the pottery sits on. Instead the pot sits on the floor of the wearchamber as the flames pass around it. \nTaking soil from a previous kiln and mixing it into mud, I formed the kiln so it was less than a meter long. It was 25 cm wide and tall inside the tunnel formed by the kiln though a slight curve was added to the tops of the side walls. The walls were covered with sticks and a roof of mud was put in place onto this. A chimney about 25 cm wide and 65 cm in total height was made at the end of the kiln to draw flames through the kiln due to natural draft. 5 grate bars made of clay were installed in the firebox to make combustion more efficient. A side door was cut into the kiln to access the ware chamber (25 x 25 cm).\nClay was taken from the creek bank and mixed with previous crushed pottery as grog. It was formed into a pot with a pouring spout. This was dried and then placed into the kiln. The kiln was fired with the flames acting as planned and the pot was fired in a relatively short 1 hour and 20 minutes. It would have been a shorter firing time had the kiln not still been wet. The pot was tested with water and held it satisfactorily. \nCross draft kilns are an apparent improvement on updrafts with the reasoning being that more efficiently retain heat as the hot gasses don't immediately exit the kiln leaving the colder gasses inside. Hot spots are less likely to develop giving a more uniform firing of the pottery. Cross draft kilns developed early in Asia, evolving from the practice of excating tunnels into the side of hills to fire pottery. It's unknown whether the European cross drafts were adopted from the east or were the result of the gradual extension of the firing arch outwards from the conventional updrafts. My personal experience is that this type of kiln fires quickly and evenly though I need to experiment more to understand the positive and negative aspects more fully.\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber."}
{"url": "https://www.youtube.com//watch?v=GzLvqCTvOQY&pp=sAQA", "description": "I made a batch of charcoal using the mound method then stored it in baskets for later use. Charcoal is a fuel that burns hotter than the wood it's made from. This is because the initial energy consuming steps of combustion have taken place while making the charcoal driving off the volatile components of the wood (such as water and sap). The result is a nearly pure carbon fuel that burns hotter than wood without smoke and with less flame. Charcoal was primarily a metallurgical fuel in ancient times but was sometimes used for cooking too. \n\nTo make the charcoal the wood was broken up and stacked in to a mound with the largest pieces in the center and smaller sticks and leaves on the out side. The mound was coated in mud and a hole was left in the top while 8 smaller air holes were made around the base of the mound. A fire was kindled in the top of the mound using hot coals from the fire and the burning process began (the hot coals are being poured in the top using a small pot at 2:38).\n\nThe fire burned down the inside of the mound against the updraft. I reason that this is a better way to make charcoal as the rising flames have used up the oxygen and prevent the charcoal already made above them from burning while driving out even more volatiles .\n\nI watched the air holes at the base of the mound and when the fire had burned right up to each opening I plugged them with mud. Once all 8 holes had be sealed the hole in the top of the mound was sealed with mud and the mound left to cool. From lighting the mound to closing up the holes the whole process took about 4 hours.\n\nThe next day when the mound was cool to the touch (this can take about 2 days sometimes) I opened the mound. The resulting charcoal was good quality. Some wood near the air entries had burned to ash though these were only small twigs and leaves. This is the reason small brush is put on the out side of the mound, to be burned preferentially to the larger wood on the inside thus protecting the large pieces of charcoal.\n\nThe charcoal that was made was hard and shiny. When broken open it had the ray structure of the wood preserved. When moving the hand through it the charcoal sounded tinny, like coral on a beach being moved by waves. These are signs of good quality. Bad charcoal is soft, breaks easily and has a muffled sound. \n\nI intend to use the charcoal to produce hotter fires than I'm able to with wood alone. From my research, a natural draft furnace using wood (a kiln) can reach a maximum of 1400 c degrees whereas a natural draft furnace using charcoal can reach 1600 c degrees. Achieving high temperatures is necessary for changing material to obtain better technology (e.g. smelting ore into metal).\n\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon page: https://www.patreon.com/user?u=2945881&ty=h\nI have no face book page. Beware of fake pages."}
{"url": "https://www.youtube.com//watch?v=aZ4KNMnTsIs&pp=sAQA", "description": "In this video I build a garden to grow Cassava and yams, two staple food crops. Cassava is a shrub that develops large edible roots. Yams are a climbing vine that produce large, edible underground bulbs and smaller aerial bulbs on their vines. \nI had 5 huts, but the wattle and daub hut (from the first video uploaded on this channel nearly 2 years ago) became dilapidated. I abandoned it in favour of the other huts I built and neglected the roof. This let water in destroying a wall. Also, the sweet potato patch behind it had a tree fall across it destroying the fence. So I demolished them both to make one large garden.\nAfter removing the fence I set a fire under the fallen tree to burn it in half rather than spend the effort of cutting it with stone tools. After burning almost all the way through, it rained. So I came back later and cut through the rest of the log with stone tools. I eventually broke the tree in half. Using smaller logs as levers I moved the tree out of the garden clearing the space for the garden.\nI then collected wood and built a simple fence that was woven loosely together with vine. The fence needs only to discourage large animals from entering to prevent them causing damage. Most times pigs and wallabies don’t know that food is growing in the garden and won’t try and enter if they see no reason to. Or at least that worked for the sweet potatoes so we’ll see if it works this time.\nFor the yam and cassava planting material I travelled far down stream to the site of my old stone hut that I built over 10 years ago. It had a corbelled dome roof that was damaged when a tree fell on it during a cyclone and it came down a few months later. The thick walls however have stayed standing for about a decade though. \nYams and cassava grew wild at this site which is one of the reasons I built the stone hut there. These plants are not native to Australia but grow wild here after having escaped from people’s gardens (similar to how wild pigs live here now after escaping from farms). The planting material for the yams are the bulbs that grow on the vines. The planting material for cassava are simply 25 cm long pieces of stem.\nOn returning to the garden, a scrub turkey was seen digging in the mounds. Protected by law, this bird has lost its fear of humans and in this case I’ve semi-domesticated it. Originally it was attracted to soil I dug up for the worms it exposed. I started leaving a pot out with small sweet potatoes in it for it to eat and now it investigates any pottery I leave for food. Now it visits my projects and will only leave if bored or chased away. I suppose this is similar to how chickens were domesticated, in fact bush turkeys and chickens are related and will produce hybrid offspring. \n Unfortunately, it has learned that the garden contains food. Originally, I was only going to plant yams but I saw the turkey digging them up and eating them. So, I planted cassava in the mounds so that the turkey would be discouraged by finding only wooden stems to peck at. I secretly planted the yams along the fence of the garden because the turkey only thinks the mounds contain yams. They can’t smell very well and only find food by sight and learned behavior. \nI planted the cassava in mounds 1 meter apart by pushing them flat into the soil. I planted the yams at intervals along the fence so they could use it as a trellis. 32 cassava stems and 12 yams were planted. Then a storm began and watered the garden. In less than a week the cassava had sprouted shoots and began to grow. The yams will take longer as I planted them deeper.\nCassava produces the most calories per time and space of any plant apart from sugar cane and sugar beet. But it requires much less fertiliser and effort. A hectare of cassava produces enough calories in 2 days to sustain a person for 1 year. It takes a year to come to harvest but will stay in the ground for a year without becoming woody. The tubers are high in starch and are what tapioca is made from. \nThis variety is called sweet cassava (actually not bitter cassava, it doesn’t taste sweet but starchy instead) and it needs to be boiled for 20 minutes to get rid of some cyanide it contains. The bitter variety contains such high levels that it kills if eaten raw and requires more extensive treatment to eat. There isn’t much nutrition in cassava other than the large amount calories it contains so other food would be required to provide protein and nutrients.  \nAfter I harvest the cassava I planted I’ll try fermenting it (which adds nutrition), drying it and pounding it into flour to make flat bread. Cassava flour has the same energy content as wheat flour, stores well and tastes somewhat similar. Or I could just cook it and eat it straight from the garden. I’ll use the yams like potatoes when they’re ready."}
{"url": "https://www.youtube.com//watch?v=wrTDJbaxhOI&pp=sAQA", "description": "Primitive Technology: Brick Firing Kiln – building a brink firing kiln from scratch.\nSubscribe: http://bit.ly/subPT | Never miss a video, enable ‘ALL’ notifications.\nWatch my 4 year anniversary video: https://youtube.com/watch?v=-cgQUrdBoaM&list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj\n\nBuy my book here: https://penguin.com.au/books/primitive-technology-9781529105834\nor here: http://hyperurl.co/PrimitiveTechnology\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n \nWatch More Primitive Technology:\nLatest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1\n\nAbout This Video:\nI built a kiln from bricks for the purpose of firing bricks. I started by using a brick mold made of fired clay from a previous video and made bricks from clay. The bricks were allowed to dry and were then transported to my hut using a brick carrying harness I made from cane and a piece of wood. They were dry stacked onto the wall of the hut to keep them out of the rain while waiting to be fired. I then constructed a brick kiln using mud as a mortar for adhering the bricks together. The kiln had 2 fireboxes side by side and was of the updraft kiln type. The kiln was open at the front and back so it could be stoked from these areas. This gave a more consistent firing I found then a kiln only with firebox opening at the front. I put 40 un-fired bricks into the kiln and fired them for 2 hours 30 minutes. All the bricks were fired sufficiently. I then tested an un-fired brick and a fired one by putting them in water. The un-fired brick dissolved quickly while the fired one survived completely intact. The test was a success. My only issue is the bricks are a little weak due to the clay they're made of. I'll look at refining clay or finding a better source somewhere in this area. \n\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.\n\n#PrimitiveTechnology"}
{"url": "https://www.youtube.com//watch?v=c2ExwOAjLNw&pp=sAQA", "description": "Blower description \nThe purpose of this project was to test a simplified blower design connected to a furnace. I purposely did this to show that people in most natural environments should be able to replicate this design without difficulty. This blower differed from the previous one in several ways to simplify the construction method.\nFirstly, the impellor was simply a stick as a rotor with a 40 cm wide rectangle of bark tied into a split in its end with a bark fibre cordage. A stone with a pit carved into it acted as a socket for the lower half of the rotor to spin in. If spun in the dirt the rotor can drill down and the position of the impellor can reach ground level causing the blades to bump into rocks and dirt. Later, I plastered the stone socket into the ground with mud to hold it securely in position (not shown in the video, just be aware of this solution if the socket shifts around too much).\nSecondly, the housing for the blower was made in situ of ordinary mud (dirt and water on site). It was a bit more than 40 cm in internal diameter. The walls of the housing were solid mud and the roof was made of sticks covered with mud. An opening more than half the length of the impellor was left in the roof to remove the impellor for maintenance and to admit air into the blower during operation. In use, the portion of this opening near the front of the blower was covered with a tile. If left opened the blower still worked but covering it improved performance by preventing air escaping near the front. In places where water is not available, a housing shaped pit covered with sticks and dirt might work instead.\nFinally, a simple length of cordage was used to drive the rotation of the impellor. This cord was placed in a notch carved into the top of the impellor rotor. The cord was wrapped around the rotor about 2.5 times. During operation the cords were pulled outwards causing the rotation. When fully unwound, the momentum of the impellor then wrapped the cord back around in the other direction. Then the cords were pulled outwards again causing the impellor to spin in the other direction. Note that this is a centrifugal blower with a symmetrical housing, therefore it doesn’t matter whether the fan spins one way or the other (clockwise or anti clockwise), the blower will always suck air in to its open top and force it into the furnace. \nThis design is easy to make and use. It can be made with minimal materials by unskilled people. The impellor design is simple yet effective. A stick, some bark and lashing of some sort should be available in most areas. The housing being made from mud, is easily sourced also. For the drive mechanism, I chose this method because the first blower I built had too many parts. There was a frame made of wood and vine to hold the rotor in place which kept causing issues with the rotor seizing or jumping out of the socket. Also, the bow that was used to drive the rotor added unnecessary complexity. In the new design, the simple cord in the notch of the rotor did away with the frame and the bow of the old design and the associated difficulties. \nFurnace experiments\nThe blower was used to power a furnace attached to the front of it. Note that with minimal materials, the blower could simply force air into a hole in the base of the furnace and work satisfactorily. But I wanted to test a different configuration so I used clay grate from a previous kiln I made. Fuel in the form of wood and charcoal was used in this furnace by being placed on top of the grate instead of under it. During operation, the blower forced air up through the grate into the burning fuel bed increasing the rate of heat production relative to the use of natural draft (convection) alone. \nI made 3 pots and fired them with charcoal. The first pot was painted with iron bacteria (iron oxide being the active ingredient). When fired, the oxide melted slightly showing minimal glazing. The clay became quite hard, possibly stoneware. The second pot was painted with wood ash and placed on a three sided clay plinth to hold the pot in the position of highest temperature in the fuel bed. The pot softened and sagged apart catastrophically. But the ash glaze gave a dark green smooth finish (difficult to see in the video). Finally, a pot was place upside down on the grate and a cylindrical brick made of iron bacteria, charcoal powder and wood ash was put on top of this. The brick melted over the pot, covering it in a viscous blob of slag rather than a thin glaze. On inspection, the slag had 1mm sized spheres of metallic iron in it. Some of these were picked out and stored in a pot. The reason for experiments like these to gain knowledge that might be of practical use in future projects that have not yet been determined.\n\nWordpress: https://primitivetechnology.wordpress.com\nPatreon page: https://www.patreon.com/user?u=2945881\nI have no face book page, instagram, twitter etc. Beware of fake pages."}
{"url": "https://www.youtube.com//watch?v=D59v74k5flU&pp=sAQA", "description": "(Turn on captions [CC] in the lower right corner for more information while viewing.)\nI made a brick mold that makes bricks 25 x 12.5 x 7.5 cm from wood. A log was split and mortise and tenon joints were carved using a stone chisel and sharp rocks. The mold was lashed together with cane to prevent it from coming apart when used. \n\nNext, I made a mixture of mud and palm fiber to make the bricks. This was then placed into the mold to be shaped and taken to a drying area. 140 bricks were made.\nWhen dry, the bricks were then assembled into a kiln. 32 roof tiles were then made of mud and fired in the kiln. It only took 3 hours to fire the tiles sufficiently. The mud bricks and tiles were a bit weaker than objects made from my regular clay source because of the silt, sand and gravel content of the soil. Because of this, I will look at refining mud into clay in future projects instead of just using mud.\n\nInterestingly, the kiln got hot enough so that iron oxide containing stones began to melt out of the tiles. This is not metallic iron, but only slag (iron oxide and silica) and the temperature was probably not very high, but only enough to slowly melt or soften the stones when heated for 3 hours.\n\nThe kiln performed as well as the monolithic ones I've built in the past and has a good volume. It can also be taken down and transported to other areas. But the bricks are very brittle and next time I'd use better clay devoid of sand/silt, and use grog instead of temper made of plant fiber which burns out in firing. The mold works satisfactorily. I aim to make better quality bricks for use in furnaces and buildings in future.\nWordpress: https://primitivetechnology.wordpress.com\nPatreon page: https://www.patreon.com/user?u=2945881\nI have no face book page, instagram, twitter etc. Beware of fake pages."}
