{"url": "https://www.youtube.com//watch?v=WghEQ0LTL1Y&pp=sAQA", "description": "Primitive Skills: Building house antique Egypt by primitive technology minecraft in rainforest #1\nHi. We are having a very big project. we will build a roman house using a very special technology of the primitive people roman. In this video we start building roman bricks to initially implement the project. In the next video we will give you new surprises. Subscribe to follow the latest videos. Thank you"}
{"url": "https://www.youtube.com//watch?v=X-gThfZPbHE&pp=sAQA", "description": "Primitive Technology Looking For Food. This is our latest video. This video we guide you to find food in the forest stream. By primitive survival skill we originally went to catch Pila conica which is a very nutritious shellfish. Then we went to find spices. We washed them all and cooked them with the pot that we had done before, then we added salt. Salt is a wonderful spice that we have created from seawater. We have made a very delicious dish. We will continue to make the latest videos on primitive technology and survival skills. Subscribe to a channel to watch the latest videos.\nChannel: https://goo.gl/Ta2ksB"}
{"url": "https://www.youtube.com//watch?v=NdTcmK9YlRE&pp=sAQA", "description": "Hi. Building a Metal Furnace Copper (Cu) is our next video. In this video we have successfully separated copper from ore by furnace, we have improved the air injection system for the furnace. We were looking for copper ore in the stream. Copper Copper (CU) a great turning point in history. It changed the primordial to a new evolution of humanity. The bronze age is quite long and very developed, as a precondition for the iron age (Fe). The melting point of the copper metal is quite fast at 1000 degrees. We will continue to create many weak Copper metal pure enough to melt, creating copper metal tools. Then we will advance to the Iron Age (Fe). We will continue to make the next video on primitive technology and wild survival skills. Subscribe to the channel to keep track of the latest videos. Thank you.\nChannel: https://goo.gl/rLur6h"}
{"url": "https://www.youtube.com//watch?v=iqjrbTJFEpg&pp=sAQA", "description": "Survival With 2 Dogs Max and Gus: Looking For Food in the Mangrove Forest Crab\nwe survival in the mangrove forest with 2 dogs. we searched for a long time and found quite a large crab."}
{"url": "https://www.youtube.com//watch?v=yN-wFCP291I&pp=sAQA", "description": "Hello. Primitive technology with survival skills: Solo 4 days on deserted island looking for food is our special video. In this video we sum up 3 previous videos of 4 days of survival on the deserted part (1 + 2 + 3). We synthesized the previous 3 videos to help people keep track. We summarize the previous 3 videos including:\n-Wild island survival challenge - Survival skills on desert island (part 1): https://youtu.be/zG-eACtVoQc\n- Wild island survival challenge - Survival island on desert island (part 2): https://youtu.be/WzuHKEa4KO4\n- Wild island survival challenge - Desert island (part 3): Survival skills: https://youtu.be/2mv8vVxISmE\nWe will continue to make the next videos about primitive technology and wild survival skills. Subscribe to the channel to watch the latest videos. Thank you."}
{"url": "https://www.youtube.com//watch?v=qxsyBvXw2rA&pp=sAQA", "description": "This is our fourth video of the primitive technology. In this video we created a bamboo water tank. When people do not have modern technology, primitive technology is a way for people to exist. These are original inventions. The bamboo water tank is a primitive technology that helps us keep water. We use the stone ax to cut bamboo, use bark to wire, we tighten the bamboo tube by the primitive technology. That is very difficult. We had to go deep into the forest to perform primitive skill. We did at a stream in the forest. I'm sure it's a good primitive technology video. We will continue to make videos of survival skills, the next primitive technology.\nPlease show your support by like, sharing and subscribing to the channel\n Channel: https://goo.gl/wobor5"}
{"url": "https://www.youtube.com//watch?v=KX6fUuv5p70&pp=sAQA", "description": "Hi. Primitive technology with survival skills waterproofing for water tanks is our next video. In this video we use plastic as a waterproofing agent for water tanks. We go to the forest looking for resin, resin can waterproof very well. The plastic has a low melting point and hardens at normal temperature. Pine can kill some types of bacteria as well as do not cause toxicity at normal temperatures. We will perform a clean water filter in the following video. We will continue to make videos on primitive technology and wilderness survival skills. Subscribe to the channel to watch the latest videos. Thank you.\nChannels: https://goo.gl/CV76zi"}
{"url": "https://www.youtube.com//watch?v=wcMq3LXp674&pp=sAQA", "description": "This is my next video. In this video we teach people how to get clean water from the forest. Clean water is essential for every one of us. We filtered turbid water for drinking water. We use rocks, sand and charcoal to filter water. By Primitive survival skills we successfully filtered dirty water into clean water. We will continue to make the next video. To keep track of our latest videos please subscribe to the channel\nChannel: https://goo.gl/tqd6zU"}
{"url": "https://www.youtube.com//watch?v=HhXhnNI20sU&pp=sAQA", "description": "Primitive Technology Earthen Pot here make our next video. In this video we made a pot of soil to prepare for the next project. We use the Primitive survival skill to make the pot. Initially we went to dig the clay then we crushed the clay and mixed them with water. We use clay to create earthen pot. We put them in the sun after which we baked pots after 3 hours we have obtained the complete pot. We will continue to make the next video on primitive technology and survival skills. Subscribe to the channel to see the latest videos.\nChannel: https://goo.gl/6Myhg2"}
{"url": "https://www.youtube.com//watch?v=Ps-xnafn8OM&pp=sAQA", "description": "Primitive Technology with Survival Skills looking for food is our next video. In this video we go to the mangrove forest to look for food. Initially we caught some small crabs and shrimp. By the primitive technology we trapped to trap large crabs with shrimp. We dig a hole to trap the crabs, when the crabs fall they can not crawl. We caught two crabs and a large number of shrimp. We have boiled crab and grilled shrimp to eat. We picked a forest for cooking with crabs. We will continue to make the next video on primitive technology and survival skills. Subscribe to the channel to watch the latest videos. Thank you.\nChannels: https://goo.gl/LTZpV9"}
{"url": "https://www.youtube.com//watch?v=krIOajjLQiQ&pp=sAQA", "description": "Primitive Technology Salt Water Filter is a full video tutorial on how to survive on an island where there is no fresh water. First we built a primitive pot, we perforated a small hole on the pot. Then we took a bamboo tube and made a chiller. Cooling water so that water vapor can condense into droplets to obtain maximum water. We take the sea water to boil. Fresh water then evaporates and produces fresh water. Salt will precipitate at the bottom of the pot. By the original technology we had to salvage sea water to obtain fresh water and salt. We will continue to work on the next video on primitive technology and survival skills. Subscribe to the channel to keep track of the latest videos\nChannel: https://goo.gl/2j7yCS"}
{"url": "https://www.youtube.com//watch?v=CLpKvCp304E&pp=sAQA", "description": "Hi. Primitive technology with survival skills wilderness crane roman is our next video. In this video we make a Roman crane for well water and serve for the construction of the Roman house. Initially they go into the forest to cut timber. By the primitive technology we have successfully built a Roman crane. Crane is used by many primitives in construction to help reduce labor. We will continue to make videos on primitive technology and wild survival skills. Subscribe to the channel to watch the latest videos. Thank you.\nChannels:  https://goo.gl/9wBjoP"}
