{"url": "https://www.youtube.com//watch?v=qeBD5MQrUrU", "description": "Video and still images of the incredibly rare and phenomenal display of nature's power witnessed in the Dodge City, Kansas area on Tuesday, May 24, 2016.  Tornadoes of many shapes and sizes occurred on this storm chase, including two close-up intercepts.  Topped off by anticrepuscular rays and sunset mammatus.  Order prints of still photos here: http://stormhighway.com/storms/tornadoes/ Copyright Dan Robinson. Music licensed from Music Bakery"}
{"url": "https://www.youtube.com//watch?v=jM3688IEU9c", "description": "Storm chasing in slow motion: Volume 1! Chasing with a high-speed camera capturing lightning and hail at 1,500 frames per second in Texas, Oklahoma and Illinois from March 22-24, 2019.  Includes downward, intracloud and upward lightning. Copyright Dan Robinson http://stormhighway.com"}
{"url": "https://www.youtube.com//watch?v=XvKxJEwI3aU", "description": "Classic Great Plains scenes during a severe weather day: a double rainbow and oil pump jacks on the prairies near Geneseo, Kansas on April 24, 2007.  Copyright Dan Robinson."}
{"url": "https://www.youtube.com//watch?v=GeY63UKMhq4", "description": "Tornadoes southeast of Spearman, Texas on May 22, 2016. Copyright Dan Robinson http://stormhighway.com/may222016.php"}
{"url": "https://www.youtube.com//watch?v=wGt0VJEmYJI", "description": "NKP 765 produces numerous vortex rings (smoke rings/steam rings) from the exhaust stack and cylinder cocks during operations in Pittsburgh on Saturday, August 11, 2012.  Some of the rings are long-lived and rise 100-200 feet or more into the air.   I grew up watching steam locomotives (during the 1980s-early 1990s excusion era), and never remember seeing one produce vortex (smoke) rings, let alone so many of them.\n\nCopyright Dan Robinson / http://stormhighway.com"}
{"url": "https://www.youtube.com//watch?v=D6xm32R5k0o", "description": "A \"cold core\" supercell/tornado event in Sedalia, Missouri on May 20, 2010.  This tornado was rated EF0 and produced minor damage to a few homes.  The first segment of video is a 100x speed clip of the storm at Knob Noster, MO just prior to the Sedalia tornado.  The last clip is a 100x speed view of the rotating Sedalia wall cloud after the main tornado.  Some brief spin-ups are apparent.  See more photos and a description of this chase at: http://stormhighway.com/may202010.shtml Copyright Dan Robinson."}
{"url": "https://www.youtube.com//watch?v=3LTxlQAHTZ4", "description": "A large, violent and long-lived tornado churns across the Kansas prairie north of Salina. Shots of the tornado in many different shapes and sizes, including wedge, cone, barrel, multiple vortex, and more.  The tornado's roar is audible at times.  Includes a sequence shot within 1/4 mile of the tornado, with rapid, mesmerizing motion in the clouds, tornado and debris cloud.  Stock footage catalog #HD-KSN-052813A Copyright Dan Robinson.  See:  http://stormhighway.com/footage/hd-ksn-052813a.php"}
{"url": "https://www.youtube.com//watch?v=cmx8GfDjetA", "description": "Late spring storms in the Midwest put on a lightning show north and east of St. Louis in Illinois on Monday, June 11, 2018.  Chase starts near Medora, IL and ends at New Baden. Outflow winds kick up dust at Troy. Copyright Dan Robinson http://stormhighway.com"}
{"url": "https://www.youtube.com//watch?v=q1vdZDA-4b8", "description": "An intense supercell produces an anticyclonic tornado from the town of Calumet to Concho in west-central Oklahoma on May 29, 2004.   See more photos and read a description of this chase at: http://stormhighway.com/may292004.shtml Copyright Dan Robinson"}
{"url": "https://www.youtube.com//watch?v=tub1a0qPjok", "description": "A long-lasting photogenic tornado develops in open country south of McLean in the Texas panhandle as large hail pounds the vehicle on May 16, 2017. Shot in 4K UHD. Copyright Dan Robinson http://stormhighway.com For licensing call Kory Hartman at 605-770-1624"}
{"url": "https://www.youtube.com//watch?v=m9APnX_xJxk", "description": "A storm produces multiple landspout tornadoes in far eastern Colorado, north of Siebert. Landspouts are a weaker type of tornado caused by a storm updraft stretching low-level vorticity on a boundary.  Copyright Dan Robinson. http://stormhighway.com"}
{"url": "https://www.youtube.com//watch?v=8MbSA0PimfY", "description": "Severe storms with damaging wind moved across the STL metro on Wednesday afternoon.  Large hail and damaging winds were reported. Call Kory Hartman for licensing at 605-770-1624 Copyright Dan Robinson http://stormhighway.com"}
{"url": "https://www.youtube.com//watch?v=E_O0K8OsFAU", "description": "Hurricane Michael makes landfall on October 10 at Panama City, Florida.  Copyright Dan Robinson http://stormhighway.com For licensing call Kory Hartman at 605-770-1624"}
