{"url": "https://www.youtube.com//watch?v=f3XYkIfdevw", "description": "Flash floods caused by torrential rains in northwest Turkey have left at least five people dead, officials said Monday.\n\nThe floods hit the town of Kestel, in Bursa province, late Sunday, sweeping away five members of a family and trapping a woman with disabilities inside her home.\n\nBy Monday morning, rescue workers found the body of the woman and recovered the bodies of four of the people washed away by the flood, the local governor's office said. A search was underway for one person who remains missing.\n\nRead more: https://www.sfchronicle.com/news/article/Floods-hit-northwest-Turkey-5-killed-1-missing-15356277.php\n\n#sel #dudaklı #kestel"}
{"url": "https://www.youtube.com//watch?v=hVUmIRaTx0c", "description": "Floods have left Kota Belud cut off by road to small and light vehicles, according to the Fire and Rescue Department. Only heavy vehicles can use the main roads connecting the town to Kota Kinabalu, and other areas.\n\nThe water level at the affected roads had reached almost half a metre in depth, said Misran Bisara, the assistant director of operations,\n\nYesterday, hundreds of vehicles were stranded at the Kota Belud main roundabout.\n\nState Public Works Department director Richard Jomiji said almost 95% of roads, except a few in Tenom and Papar, had been affected by the floods and landslides after Saturday’s heavy rainfall.\n\nHe said the department was developing traffic management plans including installing signs and warning lights in areas at risk of landslides.\n\nRead more: https://www.freemalaysiatoday.com/category/nation/2020/06/29/floods-leave-kota-belud-cut-off-to-light-vehicles/\n\n#kotabelud #banjir #cuaca"}
{"url": "https://www.youtube.com//watch?v=5gJAdEXTTk8", "description": "Hundreds of people were told to evacuate their homes on Thursday as wildfires swept through several counties in the Florida Panhandle, the authorities said.\n\nThe largest wildfire stretched across 2,000 acres in Santa Rosa County, in the northwestern part of the state, the authorities said. The fire broke out on Monday afternoon, grew as it was fanned by high winds and low humidity, and by Thursday morning it was 35 percent contained, the Florida Department of Agriculture and Consumer Services said in a statement.\n\nWinds of more than 20 miles per hour picked up embers and carried them across Interstate 10, which runs east-west through Florida, the department said. Portions of the highway were shut down.\n\nAs of early Thursday, about 1,100 people had evacuated their homes in Santa Rosa County. “That is going to continue through at least today,” said Joe Zwierzchowski, a Florida Forest Service spokesman.\n\nDozens of homes and multiple structures have been lost to the flames, he said, and the county has opened emergency shelters.\n\nMichael Dunlavy, his wife, Haley, and their five sons could see the smoke and flames from five fires several miles from their house in Milton, a city in Santa Rosa County, on Wednesday. Around noon, they received the order to evacuate. “First we went outside and looked around,” he said. “It really did not seem like it could reach us, but it was moving pretty fast.”\n\nRead more: https://www.nytimes.com/2020/05/07/us/florida-wildfire.html"}
{"url": "https://www.youtube.com//watch?v=GIXjmv2ubPs", "description": "A volcano in the southern Caribbean that had been dormant for decades erupted in a billowing blast of gray smoke Friday, spewing clouds of ash for miles and forcing thousands to evacuate.\n\nThe volcano, known as La Soufrière, on the northern tip of the main island of St. Vincent, in St. Vincent and the Grenadines, had started showing signs of renewed activity in late December. It moved into an “explosive state” on Friday morning, the National Emergency Management Organization said in a Twitter posting.\n\nThe emergency management agency said that the ash fall had been registered as far as the country’s international airport on the southern part of the island — more than 12 miles away —  while an ash plume had billowed 20,000 feet over the Atlantic Ocean.\n\nVideo clips shot in Chateaubelair, a town on the foothills of the volcano, showed the sky darkened by ash as people wearing face masks trudged through the streets lugging their belongings.\n\nThere were no immediate reports of casualties from the eruption, and the extent of any damage in the surrounding area was unclear.\n\nThe eruption came a day after officials had raised the alert level following several small tremors detected at the volcano, with clouds of steam seen erupting from its peak. The country’s prime minister, Ralph Gonsalves, ordered a full evacuation of the area.\n\nRead more: https://www.nytimes.com/2021/04/09/world/americas/volcano-St-Vincent-eruption-caribbean.html\n\n#LaSoufriere #volcano #eruption"}
{"url": "https://www.youtube.com//watch?v=oXkOAapW64U", "description": "This is a part 6 compilation of some of the best extremely close-up footage of tornadoes I could find on the Internet. When looking at a tornado in the distance, you might not know what is going on around or even inside that tornado. From a distance, it might even look peaceful. But once you get up close and personal, tornadoes become extremely frightening. When you are close to or inside of a tornado, the true power of it shows. If this ever were to happen to you, hope that you are in a shelter of some kind...\n\n#tornado #tornadoes #tornadodestruction"}
{"url": "https://www.youtube.com//watch?v=eV53F8lCMWE", "description": "An uncontrollable forest fire in Valparaiso, Chile, has made it difficult for firefighters to control on Wednesday (May 6).\n\nThe fire has not reached the city yet, but fears of danger are increasing.\n\nRead more: https://uk.news.yahoo.com/shocking-uncontrollable-forest-fire-valparaiso-110000456.html\n\n#Valparaiso #IncendioForestal #YoApoyoABomberos"}
{"url": "https://www.youtube.com//watch?v=rrHVEUCz-V4", "description": "Vietnam deployed hundreds of soldiers and heavy machinery on Thursday to search for survivors after landslides triggered by torrential rains from Typhoon Molave, one of the strongest typhoons in the region in decades, the government said.\n\nThe landslides, which hit remote areas in the central province of Quang Nam a day earlier, killed 13 with 40 missing as rescue efforts were hampered by bad weather at the tail end of the storm, the government said.\n\n\"We can forecast the storm path or the amount of rain, but can't predict when landslides happen,\" deputy Prime Minister Trinh Dinh Dung said in a statement.\n\n\"The road is covered under deep mud and heavy rains are still lashing the area, but rescue work has to be carried out quickly.\"\n\nSince early October, Vietnam has been battered by storms, heavy rains and floods which have affected more than a million people.\n\nThe government said Typhoon Molave -- also known as Quinta -- had left millions of people without electricity and damaged 56,000 houses.\n\nTwenty-six fishermen also remain missing after their boats sank when trying to return to shore on Tuesday.\n\nMolave has weakened to a tropical depression after making landfall on Wednesday and is expected to reach Laos later on Thursday.\n\nHeavy rain of up to 700 millimeters (27.5 inches) will continue in parts of central Vietnam until Saturday, Vietnam's weather agency said.\n\nRead more: https://www.cnn.com/2020/10/28/asia/vietnam-typhoon-molave-destruction-intl-hnk/index.html\n\n#molave #bão #bãosố9"}
{"url": "https://www.youtube.com//watch?v=wnAabVFdd8k", "description": "(Translated from Persian): Governor and Chairman of Quchan Crisis Management Coordination Council: The floods on Friday evening in the village of Dizadiz in the city due to heavy hail, caused 100% damage to some houses and damage to other rural units.\n\nRead more (article in Persian): https://www.entekhab.ir/fa/news/546261/%D9%88%DB%8C%D8%AF%DB%8C%D9%88-%D8%AA%D8%AE%D8%B1%DB%8C%D8%A8-%DB%B1%DB%B0%DB%B0-%D8%AF%D8%B1%D8%B5%D8%AF%DB%8C-%D8%A8%D8%B1%D8%AE%DB%8C-%D9%85%D9%86%D8%A7%D8%B2%D9%84-%D8%B1%D9%88%D8%B3%D8%AA%D8%A7%DB%8C%DB%8C-%D9%82%D9%88%DA%86%D8%A7%D9%86-%D8%AF%D8%B1-%D8%B3%DB%8C%D9%84%D8%A7%D8%A8-%D8%AF%DB%8C%D8%B1%D9%88%D8%B2\n\n#قوچان\n#سیل"}
{"url": "https://www.youtube.com//watch?v=l7diJjczf4M", "description": "This is a part 2 compilation of some of the best extremely close-up footage of tornadoes I could find on the Internet. When looking at a tornado in the distance, you might not know what is going on around or even inside that tornado. From a distance, it might even look peaceful. But once you get up close and personal, tornadoes become extremely frightening. When you are close to or inside of a tornado, the true power of it shows. If this ever were to happen to you, hope that you are in a shelter of some kind...\n\n#tornado #tornadoes #tornadodestruction"}
{"url": "https://www.youtube.com//watch?v=IoFAFvdhIQk", "description": "Indonesia’s Mount Sinabung was erupting Tuesday, sending volcanic materials as high as 5,000 meters (16,400 feet) into the sky and depositing ash on nearby villages.\n\nActivity at the volcano in North Sumatra province increased over the past week, with authorities recording 13 times when it released ash clouds.\n\nThere have been no fresh evacuations due to the activity and no reports of disruptions to flights in the region.\n\nThe 2,600-metre (8,530-feet) Sinabung was dormant for four centuries before erupting in 2010, killing two people. Another eruption in 2014 killed 17 people, while seven died in a 2016 eruption.\n\nThe volcano, one of two currently erupting in Indonesia, has sporadically come to life since then.\n\nSome 30,000 people have been forced to leave homes around Sinabung in the past few years.\n\nSinabung is among more than 120 active volcanoes in Indonesia, which is located on the \"Ring of Fire,” an arc of volcanoes and fault lines encircling the Pacific Ocean.\n\nRead more: https://abcnews.go.com/International/wireStory/indonesias-sinabung-volcano-spews-high-column-ash-76195168\n\n#gunung #sinabung #erupsi"}
{"url": "https://www.youtube.com//watch?v=O4pLn_NTdgw ", "description": "Hundreds of thousands of people were still without power, dozens of roads remained closed in Lake Charles and other areas and residents across the region were cleaning up damage Saturday as the remnants of Hurricane Delta continued to push inland across the South.\n\nLouisiana took the brunt of hurricane damage for a second time this year, after being pummeled by Hurricane Laura about six weeks ago. More than 9,400 people were being sheltered by the state Saturday, The Associated Press reported, citing Gov. John Bel Edwards. Nearly all of them were Laura evacuees.\n\nThe governor said 3,000 National Guard troops were mobilized after Delta and 10,000 utility workers were fanned out across the region.\n\nWeary residents began to return home and assess the damage in Lake Charles, where Patrick King waded thorugh knee-deep water to get his home after spending Friday night in Beaumont, Texas.\n\n“I was hoping and praying that it didn’t get into the house, but it did. It rose up close to the furniture,” King told the AP.\n\nIn the nearby community of Iowa, Brian Schexnayder’s home was badly damaged by Laura. Friday night, Hurricane Delta brought more misery.\n\n“In the first five minutes, it blew the tarp off,” Schexnayder, 62, told nola.com.\n\nRain came down into every room.\n\nDelta dumped record amounts of rain in some parts of Louisiana, causing flash flooding that stranded cars, made roads impassable and sent water into homes. More than a foot of rain fell in parts of Lake Charles.\n\n\"I'll take all the thoughts and prayers I can get right now,\" Lake Charles Mayor Nic Hunter told CNN.\n\nAbout 7,000 residents of Lake Charles had not been able to return to their homes since they were damaged by Hurricane Laura six weeks ago, Hunter said. Across the city, Hurricane Delta on Friday ripped tarps off the damaged buildings as if they were bright blue Band-Aids.\n\nMore than 497,000 customers were without power in Louisiana as of about 4 p.m. CDT Saturday, according to poweroutage.us. Another 87,000 outages were being reported in Texas, and Mississippi had more than 39,000. Thousands in Arkansas and Alabama also had no electricity. At one point Saturday morning, more than 800,000 homes and businesses along the Gulf Coast were without power.\n\nRead more: https://weather.com/news/news/2020-10-10-hurricane-delta-impacts-louisiana-texas-mississippi-alabama"}
{"url": "https://www.youtube.com//watch?v=bPwiHE8wpDg", "description": ""}
{"url": "https://www.youtube.com//watch?v=3-ChjFBZDkY", "description": "A waterspout was seen swirling above the Mediterranean Sea off the Port of Beirut, Lebanon, on October 21.\n\nThe video, filmed by Hannah Cooper, shows a waterspout forming just off the port area, which was destroyed by a huge explosion on August 4.\n\n“Just your average Wednesday in Beirut #minitornado,” Cooper wrote on Twitter.\n\nRead more: https://news.yahoo.com/waterspout-swirls-near-beirut-port-170843787.html"}
