{"url": "https://www.youtube.com//watch?v=qNwA3ipryXY", "description": "Chapter 2 from the Storm Lapse DVD with commentary: June 5, 2009 Goshen County, WY Tornado. Time lapse of a photogenic high plains, classic supercell in western Nebraska with a glimpse of the famous June 5, 2009 Goshen Co., Wyoming tornado. This video features amazing supercell structure, the rope out of a photogenic tornado, and beautiful mammatus and convection displays.  Music is courtesy Kevin MacLeod of www.incompetech.com"}
{"url": "https://www.youtube.com//watch?v=VGc0t9bBjuU", "description": "An \"elephant trunk\" tornado near Creston, Iowa on March 22, 2011."}
{"url": "https://www.youtube.com//watch?v=Tidy8mLjRe4", "description": "Chapter 20 from the Storm Lapse DVD with music only: June 21, 2010 Colorado Supercell and Cloudscape. Time lapse of a photogenic Colorado supercell, sunset skies, and surreal twilight thunderstorm convenction and lightning. Music is courtesy Kevin MacLeod of www.incompetech.com"}
{"url": "https://www.youtube.com//watch?v=g2du7HCohzs", "description": "The 2020 storm chasing season was a train wreck of uncertainty due to the pandemic, mishaps, and dismal, uncooperative weather. Events featured include:\nMarch 28 - Illinois Moderate Risk and tornado warned supercells\nApril 12 - Mississippi Moderate Risk tornado outbreak and Brooksville, EF2\nMay 17 - Decatur, Illinois localized tornado event and chase mishap\nMay 23 - Northern Illinois tornadic supercells and Coleta, EF1\nJuly 15 - Central Illinois tornadoes and Waverly, EF0 close encounter\n\nSources stats for cited stats: NOAA Storm Prediction Center and Centers for Disease Control and Prevention."}
{"url": "https://www.youtube.com//watch?v=99oNulXsdwU", "description": "These are a few of the tornadoes I intercepted on April 22, 2010 while storm chasing the Texas Panhandle.  The first two tornadoes were shot south of Jericho, TX.  At the end of the video I have a close encounter with a multi-vortex tornado north of Alanreed, TX while trying to race the rear flank core south."}
{"url": "https://www.youtube.com//watch?v=MtHyoQlZW3A", "description": "This is a weak tornado Adam Lucio and I intercepted on a storm chase just west of Kinsley, KS on June 15, 2009.  This originally looked like a rear flanking downdraft dust plume or very large gustnado.  Adam, other chasers, and I later determined, however, that this was probably a weak tornado given the rotating nub like funnel above the dust plume, and that the dust extended all the way up to this feature at times.  The speed of the video has been increased four times."}
{"url": "https://www.youtube.com//watch?v=zUHexWFFZDs", "description": "Multiple and simultaneous twin EF4 tornadoes track through northeast Nebraska on June 16, 2014.  This video documents the twin EF4s that struck Pilger and another EF4 with satellite tornado that tracked near Wakefield."}
{"url": "https://www.youtube.com//watch?v=uRmmh6VDj4s", "description": "A violent tornado just west of Albert Lea, MN that was rated EF4, shot on video while storm chasing June 17, 2010."}
{"url": "https://www.youtube.com//watch?v=QrnWs112Upo", "description": "Three hours of storm chasing compressed into 11 minutes. This includes the entire chase, from first approach of a tornado producing supercell, to leaving the storm after its last tornado at nightfall. This was the December 1, 2018 tornado outbreak over west central Illinois. Timing on the tornado tracks is a rough estimate using the National Weather Service's damage surveys. I corrected some errors in the survey tracks and timings, but they still don't line up perfectly with the video in spots. Playback speed is 16x."}
{"url": "https://www.youtube.com//watch?v=F40hxr6iLHM", "description": "Several tornadoes are filmed as they track near McCook, Nebraska on May 17, 2019."}
{"url": "https://www.youtube.com//watch?v=Rt1pcq06KHk", "description": "Funnel cloud spotted northeast of Rock Port, Missouri on April 15, 2017."}
{"url": "https://www.youtube.com//watch?v=W4EhfkcH5t0", "description": "A video summary of our storm chase through the El Reno area on May 31, 2013 featuring the 2.6 mile wide El Reno, OK EF5 tornado (later downgraded to EF3 after this video was published), and a smaller anticyclonic tornado.  In memory of Carl Young, Paul and Tim Samaras.  Music is courtesy Kevin MacLeod of www.incompetech.com"}
{"url": "https://www.youtube.com//watch?v=9rQHj46SFjs", "description": "Chapter 4 from the Storm Lapse DVD with commentary: June 14, 2009 Ulysses, Kansas tornado. Time lapse of a supercell and elephant trunk shaped tornado in western Kansas. Music is courtesy Kevin MacLeod of www.incompetech.com"}
