{"url": "https://www.youtube.com//watch?v=gd8WiiXNxho", "description": "http://www.UltimateChase.com\r\nRare and Intense video of 28 feet of storm surge rip through Gulfport, Mississippi during Hurricane Katrina. \"Battle at the Beachfront\" DVD for sale at UltimateChase.com"}
{"url": "https://www.youtube.com//watch?v=xPaIXQslKkg", "description": "http://www.UltimateChase.com\r\nThis is (Part 1) the full version of the Hurricane Charley chase with a shortened version of the \"famous\" gas station awning being shredded scene included. \r\n\r\nIf you would like to see (Part 2) the (Extended) Gas Station awning Extreme Wind gust scene please click on this link: http://youtu.be/unV5KcSrY-I\r\n\r\nTo read the chase account and see a map of Mike's location and to learn more about this insane documentation, please go to this link: http://mthurricane.com/Hurricane_Charley.htm"}
{"url": "https://www.youtube.com//watch?v=t_H4ZuJCTKQ", "description": "http://www.UltimateChase.com\r\nGiant waves pound the Nova Scotian coastline during Noel the Nor'easter. November 4th, 2007. Mike Theiss of UltimateChase.com captures Hurricane Noel's wrath on video."}
{"url": "https://www.youtube.com//watch?v=o_uzqfhwc4k", "description": "http://www.UltimateChase.com\nMike Theiss of Ultimate Chase documented Hurricane Ivan on Pensacola Beach Barrier Island in a high rise building. Watch as Mike shares his experience and imagine if that was \"You\" all alone in the pitch dark in a building completely surrounded by rushing water as a Cat 3 Hurricane makes landfall. This was an extremely creepy and scary documentation being trapped inside a building with no power and wind screaming like a monstor outside. Mike was trapped on the island for 2 days before being able to get a ride via boat back to the mainland...."}
{"url": "https://www.youtube.com//watch?v=5SyX2NUEkKk", "description": "This amazing video is some of the rarest fire tornado video ever shot ! This fire tornado was spinning away on this lake for over an hour ! The fuel for this fire is \"Bourbon\" that was leaking from the Jim Beam warehouse in Kentucky.\n\nTHIS VIDEO NOT FOR BROADCAST ! Must have written agreement with Ultimate Chase, Inc. If interested in licensing it please contact agent Mike Theiss at http://www.UltimateChase.com"}
{"url": "https://www.youtube.com//watch?v=nRVqaDmmJyY", "description": "http://www.UltimateChase.com\r\nThis video was shot in October of 1999 when the \"First\" Hurricane Irene made landfall in the Florida Keys. I shot this video when I was 21 years old and it was the 4th Hurricane I had documented in my life. I neved left my condo, I just woke up and filmed it out my windows as the storm surge rose. There is an entire missing tape so this video is a bit incomplete but I thought it would still be worth posting online. Its not the most dramatic footage I've shot but still interesting to see....The Hurricane Irene I shot in 2011 in the Bahamas was a huge improvement of video skills and quality..."}
{"url": "https://www.youtube.com//watch?v=fWtXUDLMcOg", "description": "http://www.UltimateChase.com\r\nVideo of a violent and deadly tornado heading directly for Girard, Kansas."}
{"url": "https://www.youtube.com//watch?v=7OS0dk-Thbc", "description": "http://www.UltimateChase.com\nWatch as Mike Theiss from Ultimate Chase documents Tropical Storm (almost Hurricane) Isaac in Key West, Florida. Where will Isaac go next ? Pensacola ? Mobile ? Gulfport ? New Orleans ? Subscribe today to be the first to see video shot from the landfall on the Gulf Coast..."}
{"url": "https://www.youtube.com//watch?v=iq8-Pk4Q-Ws", "description": "http://www.UltimateChase.com\nWatch as Brian Tiedemann gets video of an amazing waterspout sprayring come onshore of Key Largo, Florida ! This storm was Tornado warned and just exploded and dropped 2 waterspouts at the same time !! Subscribe today to the Ultimate Chase channel: http://www.YouTube.com/UltimateChase\n\nVideo copyright Brian Tiedemann and must have permisson from Ultimate Chase, Inc to use this video for any use. Contact Mike Theiss at UltimateChase.com"}
{"url": "https://www.youtube.com//watch?v=-hlUL3-4BUc", "description": "http://www.UltimateChase.com\nEXCLUSIVE video up close as a tornado rips through the countryside in South Dakota. Watch as a \"Lady of Victory Church\" at Plainview gets spared by less than 100 yards. Video shot by Mike Theiss while driving for Cloud 9 Tours. The power of nature up close and personal can be rewarding at times but other times disturbing and sad. While chasing Tornadoes we never wish to see these tornadoes affect peoples homes and lives. We estimate this tornado crossed the road about 200 yards in front of our location. It was hard to keep the camera steady in 80+ mph winds being sucked into the tornado.\n\nWant to see something like this is person with experienced chasers ? Check out http://www.Cloud9Tours.com to learn more about chasing with our team...."}
{"url": "https://www.youtube.com//watch?v=wsaoH5WaT6s", "description": "http://www.UltimateChase.com\nVideo of Category 3 Hurricane Willa making landfall in Teacapán, Mexico on October 23rd, 2018. This Hurricane had some of the most intense lightning I've ever witnessed in a Hurricane, you could even see the lightning in the daylight. The dog I rescued was curled up into a ball shaking and terrified in Hurricane force winds and saw me and ran up to the car. She was a very nice dog and the next day when the storm was over I gave her to someone in town and they were going to get her to her owners. Video copyright by Mike Theiss."}
{"url": "https://www.youtube.com//watch?v=oCCbZ6UTChM", "description": "http://www.UltimateChase.com\r\nVideo of lava flowing from the Kilauea Volcano into the Pacific Ocean in Hawaii."}
