{"url": "https://www.youtube.com//watch?v=0fsCGOgd9i4&pp=sAQA", "description": ""}
{"url": "https://www.youtube.com//watch?v=XkTWEp5hEZM&pp=sAQA", "description": "Halloween Wingsuit"}
{"url": "https://www.youtube.com//watch?v=M7d6ks3sTy0&pp=sAQA", "description": "Launching Kealia on a good day with the Firefly"}
{"url": "https://www.youtube.com//watch?v=Re6EF3x3_hI&pp=sAQA", "description": " "}
{"url": "https://www.youtube.com//watch?v=D9g_xrPmh-4&pp=sAQA", "description": "Back again after a month being grounded due to COVID19 Emergency Orders"}
{"url": "https://www.youtube.com//watch?v=-7GxDKneLbw&pp=sAQA", "description": "Skydive Hawaii Voggy Wingsuit"}
{"url": "https://www.youtube.com//watch?v=upnR6_iHJKM&pp=sAQA", "description": "Practice Makes Perfect\n\nCamera: Joseph Turner\nCanopy Pilot: Gage Galle\nWingsuits: Carson Klein, Scott Freeland, & TK Hinshaw"}
{"url": "https://www.youtube.com//watch?v=zf3mc2N2KfM&pp=sAQA", "description": "All footage was taken from two skydives made on Saturday morning, the 8th of September 2012."}
{"url": "https://www.youtube.com//watch?v=THoQlpE1ho0&pp=sAQA", "description": "North Shore, Oahu, Hawaii 07-Apr-2012\n\nConditions: Moderate-Strong 18-20mph winds with gusts up to 25mph\n\nSynopsis: The Ozone Firefly is a new wing design produced by Ozone. It only comes in one size: 16m. I had the chance to demo the wing at another launch, but conditions were light and I didn't get a long flight; however, I decided to order myself a wing. \n\nAfter ground handling the new wing for awhile at a grass field I recognized that it acts vastly different from Ozone's Bullet class wings. It is an \"unstable\" wing meaning that it is more susceptible to input. In short: it is more fun to fly, but more difficult to handle on the ground. \n\nDuring my initial launch & flight I found that, as I expected, the wing indeed took more skill to launch than a bullet class wing, but once in the air it excelled in its ability to turn & maneuver. The wing has excellent forward speed for a 16m & great glide performance compared to a bullet class wing. \n\nOne of the biggest lessons I learned on this first flight is to never hook the wing for landing as it causes to wing to gain altitude at a low angle of attack and then surge towards the ground, after reaching an apex, very lightly loaded with no flare. I then heard from a reliable source that it is advisable to do a slow carving turn rather than a fast hook turn for the reasons listed above. \n\nAll in all I am happy thus far with the wing. I was very conservative during this initial flight, but I look forward to a slightly less windy day to take the Firefly up and unleash the wings true potential.\n\n-TK Hinshaw"}
{"url": "https://www.youtube.com//watch?v=-H9LjWEf7yM&pp=sAQA", "description": "Fun, but didn't get the transfer"}
{"url": "https://www.youtube.com//watch?v=nWBO0mL41vc&pp=sAQA", "description": "BASE jumper decides to do a front flip off a low cliff and over-rotates. Has an 180 off heading opening, and head pinned down by 360 degree line twists. Somehow he walks away unharmed."}
{"url": "https://www.youtube.com//watch?v=UbW5xS4Xyak&pp=sAQA", "description": "Tried to build a 6-way, ended up with a four way =0"}
{"url": "https://www.youtube.com//watch?v=iftxTZQHGVY&pp=sAQA", "description": "Wingsuit Hawaii; \"God's Reign\" (These Days) ~ Ab-Soul\n\nSkydive Hawaii\n\nPilots:\nTK Hinshaw\nRandy Stamper\nAlex Frey"}
